open-vela/contest2026_264_VelaSightsuixingAIzhinengyanjing/board/beken/chips/bk7258/bk7258_camera_imgdata.c
/****************************************************************************
 * board/beken/chips/bk7258/bk7258_camera_imgdata.c
 *
 * BK7258 GC2145 camera platform (imgdata) driver: NuttX V4L2
 * imgdata_ops_s implementation for the YUV_BUF whole-frame direct-capture
 * path.  This is the platform data interface half of the driver split
 * described in the openvela Camera Driver Framework guide; sensor-specific
 * I2C register programming lives in the imgsensor half
 * (board/beken/boards/bk7258/bk7258-ap/src/bk7258_camera_imgsensor.c).
 *
 * Capture model
 * -------------
 * YUV_BUF writes a complete YUV422 frame straight into the V4L2 frame
 * buffer (which imgdata_ops_s.alloc() takes from PSRAM) and raises the
 * YUV_ARV interrupt when the frame is done.  That is the reference
 * implementation's pure-YUV path: bk_avdk_smp
 * ap/components/bk_dvp/src/bk_dvp.c dvp_camera_yuv_mode() points
 * em_base_addr at the frame buffer, and dvp_camera_yuv_eof_handler()
 * (registered on YUV_BUF_YUV_ARV) hands the finished frame up and
 * re-points em_base_addr at the next one.  There is no line-batch
 * ping-pong buffer and no DMA copy in this path -- the previous revision
 * of this driver reconstructed frames from ~60 SM0_WR/SM1_WR line-done
 * interrupts per frame plus one DMA transfer each, which is what the
 * reference only does for the combined YUV+encode formats.
 *
 * Interrupt-context rules
 * -----------------------
 * v4l2_cap.c's complete_capture() runs in interrupt context and, from
 * there, calls back into IMGDATA_SET_BUF() (to re-arm the next buffer)
 * and IMGDATA_STOP_CAPTURE()/IMGSENSOR_STOP_CAPTURE() (when it runs out
 * of vacant containers).  So set_buf() and stop_capture(), not just the
 * frame callback, must be interrupt-safe: no printf(), no blocking, no
 * allocation.  Diagnostics in those functions are guarded by
 * up_interrupt_context().
 *
 * Capture watchdog
 * ----------------
 * VIDIOC_DQBUF blocks in nxsem_wait_uninterruptible() with no timeout
 * (v4l2_cap.c capture_dqbuf()), so if the hardware never completes a
 * frame the caller's dequeue thread never returns -- which is exactly how
 * `nxcamera stream` ended up unable to process its own `q` command
 * (nxcamera_stop() posts VIDEO_MSG_STOP and then blocks in pthread_join()
 * on that thread).  This driver therefore runs a watchdog while capturing
 * and reports an error frame if no YUV_ARV arrives within
 * BK7258_CAMERA_WATCHDOG_MS: complete_capture() completes the buffer with
 * V4L2_BUF_FLAG_ERROR and posts dqbuf_wait_flg, so DQBUF returns, the
 * application loop regains control and a stop request can be honoured.
 *
 * SPDX-License-Identifier: Apache-2.0
 ****************************************************************************/

#include <nuttx/config.h>
#include <nuttx/arch.h>
#include <nuttx/clock.h>
#include <nuttx/irq.h>
#include <nuttx/kmalloc.h>
#include <nuttx/kthread.h>
#include <nuttx/semaphore.h>
#include <nuttx/signal.h>
#include <nuttx/spinlock.h>
#include <nuttx/wdog.h>

#include <sys/time.h>
#include <stdbool.h>
#include <inttypes.h>
#include <stdint.h>
#include <stdio.h>
#include <errno.h>

#include <nuttx/video/imgdata.h>

#include "bk7258_yuv_buf.h"
#include "bk7258_jpeg_enc.h"
#include "bk7258_dma.h"
#include "bk7258_camera_imgdata.h"
#include "bk7258_psram.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Geometry is not fixed here: whatever the imgsensor half can program, this
 * half must be able to receive.  The accepted geometry therefore comes from
 * the format the framework hands down at VIDIOC_S_FMT, and the only limits
 * this driver imposes are the ones the hardware really has:
 *
 *   - YUV_BUF counts in 8x8 blocks (x_pixel = width / 8), so both
 *     dimensions must be multiples of 8.
 *   - the frame must fit in PSRAM, which set_buf() checks against the
 *     buffer the framework actually allocated.
 *
 * The largest mode the sensor offers is 1600x1200, i.e. 3,840,000 bytes a
 * frame; the PSRAM display pool is 0x570000 (5,701,632) bytes, so that mode
 * admits a single buffer while 1280x720 (1,843,200) admits three.  Which of
 * those the application asks for is its business -- REQBUFS fails cleanly
 * through imgdata_ops_s.alloc() when the pool cannot satisfy it.
 */

#define BK7258_CAMERA_ALIGN       8u

/* JPEG capture.
 *
 * The encoded bitstream has no memory-mapped output on this SoC: it leaves
 * the JPEG block through a FIFO register, so a DMA channel has to drain it
 * into the V4L2 buffer (see bk7258_jpeg_enc.h).  The channel runs in REPEAT
 * mode with a looping destination, so one configuration absorbs a whole
 * frame regardless of how big it turns out to be.
 *
 * BK7258_CAMERA_JPEG_CHUNK is the DMA's transfer_len, i.e. how often the
 * finish interrupt fires.  10KB matches the reference's FRAME_BUFFER_CACHE
 * (dvp_private.h); at a typical 30KB frame that is a handful of interrupts
 * per frame, which is cheap enough while still bounding how much of a frame
 * is in flight.
 *
 * The encoder appends 5 CRC bytes after the bitstream (JPEG_CRC_SIZE in
 * hal_jpeg_types.h).  They travel through the FIFO like everything else but
 * are not part of the image, and byte_count_pfrm does not count them --
 * which is why this driver takes byte_count_pfrm as the length and does not
 * subtract anything.
 *
 * BK7258_CAMERA_JPEG_EOI_WINDOW is how far back from that length to look for
 * the FF D9 end-of-image marker.  The reference searches the last 10 bytes
 * and trims to the marker; the same check doubles as proof that the frame
 * arrived whole, so a frame without it is completed as an error rather than
 * handed to the application as a truncated file.
 */

/* Lines of the encoder's input staging area in PSRAM.
 *
 * In JPEG mode YUV_BUF does not write frames; it stages line batches for the
 * encoder to consume, and its frame-buffer register points at that staging
 * area (yuv_buf_hal_set_jpeg_mode_config() writes em_base_addr from
 * config->base_addr, which the reference fills with a buffer of
 * width * 32 * 2 bytes -- bk_camera_dvp_ctlr.c).
 *
 * Pointing that register at the V4L2 buffer instead, as a first attempt did,
 * makes the module write raw pixels straight over the bitstream the DMA is
 * depositing there: the captured file then contains recognisable UYVY data
 * and never starts with FF D8.
 */

#define BK7258_CAMERA_JPEG_STAGE_LINES 32u

#define BK7258_CAMERA_JPEG_DMA_CH     0u
#define BK7258_CAMERA_JPEG_CHUNK      (10u * 1024u)

/* Ring size in chunks.  24 chunks is 240KB, about eight 640x480 frames at the
 * measured 25KB: enough that a late copy cannot be overtaken by the encoder,
 * and small enough to sit in the display pool alongside everything else.
 */

