open-vela/contest2026_264_VelaSightsuixingAIzhinengyanjing/board/beken/chips/bk7258/bk7258_camera_imgdata.c
#define BK7258_CAMERA_JPEG_RING_CHUNKS 24u
#define BK7258_CAMERA_JPEG_RING_SLOTS  3u
#define BK7258_CAMERA_JPEG_VALIDATE_BYTES (80u * 1024u)

/* How far into a span to look for the frame's SOI.  The leftovers of the
 * previous frame measured a few dozen bytes; 256 is comfortable slack and
 * still far short of the header, so a hit can only be the real frame start.
 */

#define BK7258_CAMERA_JPEG_SOI_SCAN   256u
#define BK7258_CAMERA_JPEG_EOI_BACK   16u
#define BK7258_CAMERA_JPEG_EOI_FWD    1024u

/* How long the EOF handler may wait for the encoder's output FIFO to empty.
 *
 * Configurable because it is a busy-wait in interrupt context and the vendor
 * does not have it at all: its EOF handler flushes and stops the channel
 * straight away, and catches whatever the drain left behind through the
 * byte-count reconciliation below.  Keeping the wait is cheaper than
 * discarding a frame, but only measurement can say how long it really runs,
 * which is what jpeg_drain_spins_max is for.
 */

#ifndef CONFIG_BK7258_CAMERA_JPEG_DRAIN_SPINS
#  define CONFIG_BK7258_CAMERA_JPEG_DRAIN_SPINS 100000
#endif

#define BK7258_CAMERA_JPEG_DRAIN_SPINS \
  ((uint32_t)CONFIG_BK7258_CAMERA_JPEG_DRAIN_SPINS)

/* How many macroblocks of a delivered frame are Huffman-validated.
 *
 * Zero means the whole frame, which is what this driver did until now and
 * what CONFIG_BK7258_CAMERA_JPEG_VALIDATE_MCUS=0 restores.  See
 * bk7258_jpeg_realign_entropy_prefix() for why a prefix settles the question
 * the walk is asked (bit alignment is a property of the whole scan) and what
 * it gives up (corruption past the prefix, which the reconciliation covers).
 */

#ifndef CONFIG_BK7258_CAMERA_JPEG_VALIDATE_MCUS
#  define CONFIG_BK7258_CAMERA_JPEG_VALIDATE_MCUS 0
#endif

#ifndef CONFIG_BK7258_CAMERA_JPEG_DMA_DEST_BURST
#  define CONFIG_BK7258_CAMERA_JPEG_DMA_DEST_BURST 0
#endif

/* Tolerance for the delivered-versus-counted comparison.
 *
 * The hardware appends JPEG_CRC_SIZE (5) bytes after the end-of-image marker
 * and the last DMA chunk is accounted in whole 32-bit words, so a healthy
 * frame does not match exactly; the vendor allows any difference short of a
 * whole chunk.  This window is deliberately much tighter, because its
 * purpose here is to notice a span that picked up a neighbour's bytes.
 */

#define BK7258_CAMERA_JPEG_RECON_SLACK 64

#ifdef CONFIG_BK7258_CAMERA_JPEG_RECONCILE
#  define BK7258_CAMERA_JPEG_RECON_ENFORCED 1
#else
#  define BK7258_CAMERA_JPEG_RECON_ENFORCED 0
#endif

/* Smallest V4L2 buffer this driver will drain an encoded frame into.
 *
 * For a compressed format the buffer size is the application's choice, not a
 * function of the geometry: v4l2_cap.c's get_bufsize() returns the format's
 * sizeimage when the application set one and only falls back to width*height
 * when it did not.  Both are legal, and they differ by a lot -- packages/
 * ai_agent asks for 160KB while width*height at 480x480 is 225KB -- so the
 * driver cannot derive the capacity and has to take what set_buf() is given.
 *
 * Two chunks is the floor.  The drain channel loops over the buffer in
 * transfer_len steps, so a capacity below one step cannot be armed at all,
 * and a capacity of exactly one step leaves no room to tell "wrapped" from
 * "filled".  Anything smaller would also be far below a real frame: the
 * reference sizes its own frame cache at one chunk (dvp_private.h).
 */

#define BK7258_CAMERA_JPEG_MIN_BUF    (BK7258_JPEG_ENC_PAD + \
                                       2u * BK7258_CAMERA_JPEG_CHUNK)

/* YUV_BUF writes frames over the PSRAM bus; a frame buffer outside PSRAM
 * would be silently dropped (or corrupt unrelated memory), so set_buf()
 * rejects one.  PSRAM is mapped at SOC_PSRAM_DATA_BASE, 16MB.
 */

#define BK7258_CAMERA_PSRAM_BASE  0x60000000u
#define BK7258_CAMERA_PSRAM_END   0x61000000u

#define BK7258_CAMERA_IS_PSRAM(p) \
  ((uintptr_t)(p) >= BK7258_CAMERA_PSRAM_BASE && \
   (uintptr_t)(p) < BK7258_CAMERA_PSRAM_END)

/* Upper bound on how long VIDIOC_DQBUF may block before this driver
 * reports an error frame instead of letting the caller hang forever.
 * 500ms is ~15 frame periods at 30fps: long enough never to fire during
 * healthy streaming, short enough that a `q` keystroke feels responsive.
 */

#define BK7258_CAMERA_WATCHDOG_MS 500

/* The JPEG completion thread, and why this driver runs its own instead of
 * using LPWORK.
 *
 * Finishing a hardware JPEG means walking its entropy stream (see
 * bk7258_jpeg_entropy.c), which measured 252 ms per frame on 2026-08-31 --
 * 82 runs totalling 20.7 s inside a 32.6 s session, 63% of the only core
 * this chip schedules on.  On LPWORK that work inherits
 * CONFIG_SCHED_LPWORKPRIORITY, which is 100 here, and 100 is also
 * SCHED_PRIORITY_DEFAULT: the same priority as the velasight UI loop and as
 * nsh_main.  Round robin then split the core four ways in slices of
 * CONFIG_RR_INTERVAL, and one validation run was longer than a whole slice.
 * The visible result was a UI that did not repaint and a console that
 * printed "ps" at roughly one line per 1.75 s against 7.8 ms when idle.
 *
 * 90 puts it below both, so the UI and the shell always preempt it.  The
 * trade is deliberate: under load the validator falls behind and jpeg_hw_busy
 * grows, which drops camera frames.  Dropping frames is the right failure --
 * the session samples at CONFIG_VS_SOCIAL_CAPTURE_FPS, single digits, while a
 * frozen UI has no acceptable version.
 *
 * Lowering CONFIG_SCHED_LPWORKPRIORITY instead would fix this path and break
 * others: LPWORK is shared, in this tree by bk7258_mmcsd.c and
 * bk7258_bt_gatt_test.c and by whatever NuttX's own drivers queue there.
 *
 * The stack matches what this code already ran on (CONFIG_SCHED_LPWORKSTACKSIZE
 * is 8192 in this configuration), so moving it cannot regress depth.
 */

#define BK7258_CAMERA_JPEG_PRIORITY   90
#define BK7258_CAMERA_JPEG_STACKSIZE  8192

/* SRAM held for the entropy prefix.  See g_jpeg_prefix for why it exists and
 * why it is this size; .bss has about 23 KB spare, so this is not free.
 */

