open-vela/contest2026_264_VelaSightsuixingAIzhinengyanjing/board/beken/chips/bk7258/bk7258_camera_imgdata.c
#define BK7258_CAMERA_JPEG_PREFIX_BYTES 4096u

/* Upper bound on the uninit drain below, in milliseconds.  One validation is
 * 252 ms, so this is several times the worst case and exists only so a lost
 * completion cannot wedge a close.
 */

#define BK7258_CAMERA_JPEG_DRAIN_MS   2000

/* Why the encoder is not started on a frame boundary.
 *
 * Every JPEG session begins with exactly err=3 resets=3 short=1 and then
 * runs clean, no matter how long it is (measured at 3, 13 and 33 frames:
 * the counts did not move).  So the errors are a start-up transient, not a
 * per-frame defect.  The reason looked obvious: the reference arms its
 * capture path before it initialises the sensor (bk_dvp.c dvp_camera_init(),
 * step 5 bk_yuv_buf_start(JPEG_MODE) then step 6 sensor->init()), so its
 * encoder always sees a stream that starts at a frame boundary, whereas this
 * driver leaves the sensor streaming from init (bk7258_camera_imgsensor.c)
 * and therefore enables the encoder at an arbitrary phase -- and a partial
 * frame is exactly what the encoder reports as frame_err (the reference
 * names that handler dvp_camera_sensor_ppi_err_handler, i.e. "the picture is
 * not the size I was told").
 *
 * Waiting for one VSYNC before bk7258_jpeg_enc_start() was tried and does
 * not work, because the premise is circular: in JPEG mode the VSYNC events
 * only start once the encoder is enabled.  yuv_mode is off in this mode
 * (see bk7258_yuv_buf_start_jpeg()), so until the JPEG block runs there is
 * no sync detection to report a boundary.  Measured: the wait timed out in
 * all three sessions, and the only effect was the wait itself -- a 30-frame
 * session went from 29.72 to 25.99 fps (elapsed 1110ms -> 1231ms).
 *
 * The transient is harmless where it matters: it is absorbed before the
 * application sees anything.  A frame without an EOI is completed with an
 * error and never handed up, so the first frame an application dequeues is
 * a whole one -- measured across three sessions, frame 0 came back with
 * bytesused 13079 / 13147 / 13111, SOI and EOI present, flags 0.  That is
 * what matters for packages/ai_agent, whose camera_capture tool takes
 * exactly one frame.
 *
 * Eliminating it for real means giving the sensor a stream on/off that
 * start_capture() can sequence against, which is a change to the imgsensor
 * side and to the already-validated UYVY path.  Not worth it for three
 * absorbed errors.
 */

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct bk7258_camera_imgdata_s
{
  struct imgdata_s data;          /* Must be first: base-pointer cast. */
  FAR uint8_t *frame_buf;          /* Set by set_buf(); NULL until then. */
  uint32_t frame_buf_size;
  uint16_t width;                  /* Latched by validate_frame_setting(). */
  uint16_t height;
  uint32_t frame_bytes;            /* Buffer bytes one frame needs. */
  bool jpeg;                       /* Encoded output rather than raw YUV. */
  bool jpeg_software;              /* This geometry uses software fallback. */
  volatile uint32_t jpeg_chunks;   /* DMA chunk interrupts, diagnostics. */
  volatile uint32_t jpeg_frame_chunks; /* Chunks since the channel was armed. */
  volatile uint32_t jpeg_short;    /* Frames completed without an EOI. */
  volatile uint32_t jpeg_err_seen; /* err_count at the last VSYNC check. */
  volatile uint32_t jpeg_resets;   /* Recoveries performed. */
  volatile uint32_t jpeg_vsyncs;   /* VSYNC negedges seen this session. */

  /* Both JPEG completion paths -- the hardware encoder's entropy validation
   * and the software encoder -- are handed to bk7258_camera_jpeg_thread()
   * rather than to LPWORK, for the reason at BK7258_CAMERA_JPEG_PRIORITY.
   * The interrupt stores which one it wants and posts the semaphore; that is
   * all it does, so the DMA ring's interrupt-side bookkeeping stays live.
   *
   * jpeg_encoding is the mutual exclusion: an interrupt that finds it set
   * drops its frame instead of posting again, so at most one post is ever
   * outstanding and jpeg_handler cannot be overwritten under the thread.
   */

  sem_t jpeg_sem;
  pid_t jpeg_pid;                  /* <= 0 until the thread exists */

  /* volatile qualifies the pointer, not the function: an interrupt writes it
   * and the thread reads it, so the compiler must not keep it in a register
   * across the semaphore wait.
   */

  CODE void (* volatile jpeg_handler)(FAR void *arg);

  /* Two staging frames, filled alternately by YUV_BUF.  One is being encoded
   * while the other takes the next frame, and a frame that arrives while the
   * encoder is busy overwrites the *unprocessed* one -- which is the
   * "drop the oldest unprocessed frame" rule the product spec asks for, and
   * the opposite of what a single buffer would do (it would either tear or
   * make the newest frame wait behind an old one).
   */

  FAR uint8_t *jpeg_raw[2];        /* UYVY staging, PSRAM */
  uint8_t jpeg_raw_fill;           /* Which one the hardware is filling */
  int8_t jpeg_raw_ready;           /* Newest complete one, -1 if none */
  uint32_t jpeg_raw_bytes;
  clock_t jpeg_next_sample;        /* Earliest tick for the next encode */

  /* The delivery rate in force for this stream, and the period derived from
   * it.  CONFIG_BK7258_CAMERA_JPEG_FPS is the ceiling; an application may ask
   * for less through VIDIOC_S_PARM.  See bk7258_camera_jpeg_sample_period().
   */

  uint32_t jpeg_fps;
  clock_t  jpeg_sample_period;
  volatile bool jpeg_encoding;     /* An encode is in flight */
  volatile bool jpeg_buf_armed;    /* The framework queued a buffer that has
                                    * not been completed yet */
  volatile uint32_t set_buf_live;   /* set_buf calls made while streaming */
  volatile uint32_t jpeg_sw_frames;
  volatile uint32_t jpeg_sw_drops;    /* Unprocessed frames replaced */
  volatile uint32_t jpeg_sw_skipped;  /* Frames the 5fps sampler passed on */

  /* jpeg_sw_drops used to count both "the encoder was still busy" and "the
   * application had not queued a buffer", which made a stall impossible to
   * attribute: the two have opposite causes and opposite fixes.  Split.
   */

  volatile uint32_t jpeg_sw_busy;      /* Skipped: an encode was in flight   */
  volatile uint32_t jpeg_sw_nobuf;     /* Skipped: no queued V4L2 buffer     */
  volatile uint32_t jpeg_hw_busy;      /* HW frames skipped while validating */
  volatile clock_t  jpeg_last_now;     /* Ticks at the last sampler decision */
  uint32_t jpeg_work_len;              /* Raw length ending after EOI */
  bool jpeg_work_finish_pending;       /* DMA diagnostic for queued frame */
  struct timeval jpeg_work_ts;         /* EOF time reported on completion */
  FAR uint8_t *jpeg_stage;         /* Encoder input staging area, PSRAM. */
  uint32_t jpeg_stage_bytes;
  FAR uint8_t *jpeg_validate_scratch; /* Entropy parser input, internal RAM */
  uint32_t jpeg_validate_scratch_bytes;
  volatile uint32_t jpeg_validate_ticks;
  volatile uint32_t jpeg_validate_runs;
  volatile int32_t jpeg_eoi_delta;  /* EOI offset minus byte_count_pfrm. */
  volatile uint32_t jpeg_hdr_fail;  /* Frames whose header could not be
                                     * rebuilt (bitstream not as expected). */
  volatile uint32_t jpeg_bit_fixed; /* Frames repaired by dropping leading
                                     * entropy bits. */
  volatile uint32_t jpeg_bit_fail;  /* Frames with no valid bit alignment. */
  volatile uint8_t jpeg_tail[8];    /* Bytes around a rejected frame's end. */
  volatile uint32_t jpeg_tail_at;   /* Where jpeg_tail was sampled. */

  /* Where the time in a delivered frame actually goes.
   *
   * Cycle counts, not ticks: at CONFIG_USEC_PER_TICK=1000 a tick cannot see
   * the copy at all, and "0 ms" is indistinguishable from "not measured".
   * up_perf_gettime() is the DWT cycle counter on this core (armv8-m
   * arm_perf.c), so these are directly comparable with each other and, once
   * divided by the elapsed wall time, they also say what the core clock
   * really is -- which is the one number the driver has so far had to assume
   * (CONFIG_BK7258_CPU_FREQ_HZ only ever reached systick).
   */

