open-vela/contest2026_264_VelaSightsuixingAIzhinengyanjing/board/beken/chips/bk7258/bk7258_camera_imgdata.c
  /* 64-bit because 32 was not enough.  CONFIG_SYSTEM_TIME64 makes
   * up_perf_gettime() a 64-bit cycle count already; the overflow was in these
   * accumulators and in the casts that fed them.  Measured 2026-09-03: a
   * 48 s session at 2 fps summed to 4.05e9 cycles across the four, against a
   * uint32_t ceiling of 4.29e9 -- 6% of headroom, and a longer session or a
   * higher frame rate would have wrapped silently and turned this whole
   * breakdown into noise.
   */

  volatile uint64_t jpeg_copy_cycles;    /* Ring span -> V4L2 buffer */
  volatile uint64_t jpeg_hdr_cycles;     /* write_header() */
  volatile uint64_t jpeg_scratch_cycles; /* Entropy in/out of scratch */
  volatile uint64_t jpeg_realign_cycles; /* Huffman/MCU validation */
  volatile uint64_t jpeg_prefix_cycles;  /* Entropy prefix -> SRAM */

  /* Frames the SRAM prefix could not settle, so the heap scratch had to.
   * Zero means the prefix is doing its job; a rising count means it is too
   * small for this resolution, not that anything is wrong.
   */

  volatile uint32_t jpeg_prefix_miss;
  clock_t jpeg_start_cycles;             /* Cycle counter at stream start */

  /* Worst and total FIFO drain waits, and how often the wait ran out. */

  volatile uint32_t jpeg_drain_spins_max;
  volatile uint32_t jpeg_drain_spins_sum;
  volatile uint32_t jpeg_drain_timeouts;

  /* The vendor's frame-integrity check: what the hardware says it encoded
   * against what the DMA actually delivered (dvp_camera_jpeg_eof_handler()).
   * Recorded always; enforced only with CONFIG_BK7258_CAMERA_JPEG_RECONCILE,
   * because the tolerance window is a property of this board's drain
   * behaviour and has to be measured before it can be trusted to reject.
   */

  volatile int32_t jpeg_recon_delta;    /* Last delivered-minus-counted */
  volatile int32_t jpeg_recon_worst;    /* Largest magnitude seen */
  volatile uint32_t jpeg_recon_bad;     /* Frames outside the window */

  /* The drain ring.  Three slots: the DMA owns one at a time and is switched
   * to the next at every EOF -- flush, stop, re-arm, exactly as the vendor
   * does at its own frame boundary (dvp_camera_jpeg_eof_handler()).  The
   * difference is only where it re-arms to: the vendor points the channel at
   * the next frame buffer it will hand up, while this driver cannot (the
   * framework supplies one buffer at a time, inside the completion
   * callback), so a frame is a span of the slot that was just closed,
   * copied out from there.
   */

  FAR uint8_t *jpeg_ring;
  uint32_t jpeg_ring_bytes;
  uint32_t jpeg_ring_read;            /* Offset within the current slot */
  uint8_t jpeg_ring_slot;             /* Slot currently owned by DMA */
  volatile uint32_t jpeg_ring_chunks; /* Cumulative, never reset */
  volatile uint32_t jpeg_ring_over;   /* Spans longer than the ring */
  volatile uint32_t jpeg_resync;      /* Spans that needed SOI realignment */
  volatile uint32_t jpeg_no_soi;      /* Spans dropped for having no SOI */
  volatile uint32_t jpeg_finish_pending; /* EOF snapshots with FINISH pending */
  volatile uint32_t jpeg_pending_mask;   /* First 32 delivered frame indices */
  volatile int32_t jpeg_pending_delta;   /* raw delivered - hw byte_count */

  /* Set by any path that decided the pipeline is out of step, cleared by the
   * VSYNC handler once it has reset it.  The vendor keeps exactly one such
   * flag (dvp_driver_handle_t::error) and every producer of an error sets it
   * rather than recovering on the spot, so recovery always lands on a frame
   * boundary.  Before this, only the encoder's own err_count could trigger a
   * reset, and a frame lost to a missing EOI or an unrecognisable span left
   * the hardware running with whatever phase had caused it.
   */

  volatile bool jpeg_error;
  volatile bool capturing;
  imgdata_capture_t capture_cb;
  FAR void *capture_cb_arg;
  struct wdog_s watchdog;
  volatile uint32_t frames_done;   /* Frames handed to the framework. */
  volatile uint32_t frames_at_arm; /* frames_done when watchdog last armed */
  volatile uint32_t timeouts;      /* Watchdog error reports. */
  volatile uint32_t set_buf_calls;
  volatile uint32_t rejected_bufs;
  clock_t start_ticks;             /* For the measured frame rate. */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static int bk7258_camera_imgdata_init(FAR struct imgdata_s *data);
static int bk7258_camera_imgdata_uninit(FAR struct imgdata_s *data);

/* Declared here because bk7258_camera_jpeg_eof() posts from interrupt context
 * well before the definition, which has to follow both handlers it dispatches.
 */

static int bk7258_camera_jpeg_post(FAR struct bk7258_camera_imgdata_s *priv,
                                   CODE void (*handler)(FAR void *arg));
static int bk7258_camera_imgdata_set_buf(FAR struct imgdata_s *data,
                                          uint8_t nr_datafmts,
                                          FAR imgdata_format_t *datafmts,
                                          uint8_t *addr, uint32_t size);
static int bk7258_camera_imgdata_validate_frame_setting(
    FAR struct imgdata_s *data, uint8_t nr_datafmts,
    FAR imgdata_format_t *datafmts, FAR imgdata_interval_t *interval);
static int bk7258_camera_imgdata_start_capture(
    FAR struct imgdata_s *data, uint8_t nr_datafmts,
    FAR imgdata_format_t *datafmts, FAR imgdata_interval_t *interval,
    imgdata_capture_t callback, FAR void *arg);
static int bk7258_camera_imgdata_stop_capture(FAR struct imgdata_s *data);
static void *bk7258_camera_imgdata_alloc(FAR struct imgdata_s *data,
                                          uint32_t align_size,
                                          uint32_t size);
static void bk7258_camera_imgdata_free(FAR struct imgdata_s *data,
                                        void *addr);
static void bk7258_camera_watchdog_expiry(wdparm_t arg);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* The bytes the prefix walk actually reads, in SRAM, and the reason this
 * driver has two entropy buffers instead of one.
 *
 * jpeg_validate_scratch comes from kmm_malloc(), and the error message for a
 * failed allocation says "no internal RAM" -- which was the intent, not a
 * guarantee.  bk7258_psram.c adds 6 MB of PSRAM to the same heap with
 * kmm_addregion() and says so plainly in its own comment: "mm has no way to
 * steer allocations".  CONFIG_BUILD_FLAT means one heap; .bss already holds
 * 320 of the 336 KB of SRAM (the IOB pool alone is 92 KB, LVGL's is 64 KB),
 * so the heap that request lands in is PSRAM, mapped non-cacheable.  Every
 * byte the Huffman decoder reads is then an uncached bus transaction.
 *
 * Measured 2026-09-03, 480x480, VALIDATE_MCUS=128, 75 frames: the scratch
 * memcpy cost 16291532 cycles per frame and the prefix walk 37206069, which
 * at the 481 MHz the cycle counter implies is 33.9 ms and 77.4 ms.  111 ms of
 * the validator's 112 ms went to those two, against the 1-4 ms the same code
 * measures with its input in SRAM.  Per byte the walk was 30 times more
 * expensive than the memcpy over the same memory, because a bit reader loads
 * single bytes where memcpy moves words.
 *
 * The walk only needs a prefix -- 128 macroblocks of 1800 at this size, about
 * 1.9 KB of the 26 KB stream -- so the fix is to put that much in SRAM rather
 * than the whole frame.  4 KB is a little over twice the measured need and
 * fits in what .bss has left.  A frame whose prefix does not fit, or that
 * needs a bit shift applied, falls back to the PSRAM scratch and pays the old
 * price; jpeg_prefix_miss counts how often that happens, so the size can be
 * revisited from data rather than guessed at again.
 */

static uint8_t g_jpeg_prefix[BK7258_CAMERA_JPEG_PREFIX_BYTES]
  __attribute__((aligned(8)));

static const struct imgdata_ops_s g_bk7258_camera_imgdata_ops =
{
  .init                   = bk7258_camera_imgdata_init,
  .uninit                 = bk7258_camera_imgdata_uninit,
  .set_buf                = bk7258_camera_imgdata_set_buf,
  .validate_frame_setting = bk7258_camera_imgdata_validate_frame_setting,
  .start_capture          = bk7258_camera_imgdata_start_capture,
  .stop_capture           = bk7258_camera_imgdata_stop_capture,
  .alloc                  = bk7258_camera_imgdata_alloc,
  .free                   = bk7258_camera_imgdata_free,
};

static struct bk7258_camera_imgdata_s g_bk7258_camera_imgdata =
{
  .data = { &g_bk7258_camera_imgdata_ops },
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: bk7258_camera_now
 *
 * Description:
 *   Interrupt-safe timestamp for the capture callback: derived from the
 *   system tick counter rather than from clock_gettime()/gettimeofday(),
 *   neither of which is meant to be called from an interrupt handler.
 *
 ****************************************************************************/

static void bk7258_camera_now(FAR struct timeval *ts)
{
  clock_t ticks = clock_systime_ticks();

