open-vela/contest2026_264_VelaSightsuixingAIzhinengyanjing/board/beken/chips/bk7258/bk7258_camera_imgdata.c
  ts->tv_sec  = ticks / TICK_PER_SEC;
  ts->tv_usec = (ticks % TICK_PER_SEC) * (USEC_PER_SEC / TICK_PER_SEC);
}

/****************************************************************************
 * Name: bk7258_camera_jpeg_sample_period
 *
 * Description:
 *   Work out how often this stream should deliver a frame, from the interval
 *   the application asked for and the build's ceiling.
 *
 *   CONFIG_BK7258_CAMERA_JPEG_FPS stays what its help text says it is -- an
 *   upper bound, defaulting to the rate the encoder can actually reach, so a
 *   build never throttles itself below the hardware.  What was missing is the
 *   other half of that argument: it says sampling "belongs to whoever is
 *   uploading", but the interval such a caller passes was accepted by the
 *   framework and then discarded here, so the only way to sample slower was
 *   to lower the ceiling for every application in the image.
 *
 *   That mattered once social mode existed.  It wants a few frames a second
 *   and paces its own dequeues accordingly, but the pacing was on the wrong
 *   side of the driver: every frame this module delivers costs a copy out of
 *   the drain ring plus, on the hardware path, a full 4:2:2 Huffman
 *   validation over non-cacheable PSRAM, and it was paying that at the
 *   ceiling rate while reading a fraction of the result.  Lowering the
 *   ceiling instead would have taken web_tool's live preview down with it,
 *   because both are the same /dev/video0 and the ceiling is one build-wide
 *   constant.
 *
 *   Zero or nonsense means "no request": the framework seeds the interval
 *   from the sensor's default and a caller that never issues VIDIOC_S_PARM
 *   should keep the behaviour it had.  A request above the ceiling is capped
 *   rather than refused, because the ceiling is a statement about the
 *   hardware and no caller can argue with it.
 *
 ****************************************************************************/

static void bk7258_camera_jpeg_sample_period(
    FAR struct bk7258_camera_imgdata_s *priv,
    FAR const imgdata_interval_t *interval)
{
  uint32_t fps = CONFIG_BK7258_CAMERA_JPEG_FPS;

  if (interval != NULL && interval->denominator != 0)
    {
      uint32_t requested = interval->denominator /
                           (interval->numerator != 0 ?
                            interval->numerator : 1u);

      if (requested != 0 && requested < fps)
        {
          fps = requested;
        }
    }

  priv->jpeg_fps = fps;

  /* At least one tick, so a rate the tick resolution cannot express degrades
   * to "every frame" instead of to a period of zero, which would compare as
   * already due and defeat the gate entirely.
   */

  priv->jpeg_sample_period = MSEC2TICK(1000u / fps);
  if (priv->jpeg_sample_period == 0)
    {
      priv->jpeg_sample_period = 1;
    }
}

/****************************************************************************
 * Name: bk7258_camera_watchdog_arm
 *
 * Description:
 *   (Re)starts the capture watchdog and records the frame count it is
 *   measuring against.  Interrupt-safe.
 *
 ****************************************************************************/

static void bk7258_camera_watchdog_arm(
    FAR struct bk7258_camera_imgdata_s *priv)
{
  priv->frames_at_arm = priv->frames_done;
  wd_start(&priv->watchdog, MSEC2TICK(BK7258_CAMERA_WATCHDOG_MS),
           bk7258_camera_watchdog_expiry, (wdparm_t)priv);
}

/****************************************************************************
 * Name: bk7258_camera_jpeg_dma_arm
 *
 * Description:
 *   Points the drain channel at the slot the DMA is to own next and starts
 *   it.
 *
 *   Called at stream start, from the frame-done path and from the VSYNC
 *   recovery, so it must be safe in interrupt context: register writes only.
 *
 *   The destination loops over exactly one slot of the ring.  That bound is
 *   what keeps a runaway encoder from writing past it: a frame larger than a
 *   slot wraps and corrupts its own beginning, which the SOI/EOI checks then
 *   reject, instead of corrupting somebody else's memory.
 *
 ****************************************************************************/

static void bk7258_camera_jpeg_dma_arm(
    FAR struct bk7258_camera_imgdata_s *priv)
{
  struct bk7258_dma_cfg_s cfg;

  /* The bitstream lands BK7258_JPEG_ENC_PAD bytes into the buffer, leaving
   * room for the standards-conforming header that replaces the block's own
   * one when the frame completes (bk7258_jpeg_enc_write_header()).  The DMA
   * window shrinks by the same amount so it still cannot run past the buffer.
   */

  uint32_t slot_bytes = priv->jpeg_ring_bytes /
                        BK7258_CAMERA_JPEG_RING_SLOTS;
  uint32_t dest = (uint32_t)(uintptr_t)(
    priv->jpeg_ring + (uint32_t)priv->jpeg_ring_slot * slot_bytes);

  cfg.channel         = BK7258_CAMERA_JPEG_DMA_CH;
  cfg.src_addr        = bk7258_jpeg_enc_get_fifo_addr();
  cfg.dest_addr       = dest;
  cfg.transfer_len    = BK7258_CAMERA_JPEG_CHUNK;
  cfg.src_dev         = BK7258_DMA_DEV_JPEG;
  cfg.dest_dev        = BK7258_DMA_DEV_MEM;
  cfg.src_inc         = false;   /* A FIFO: the address must not move. */
  cfg.dest_inc        = true;
  cfg.repeat          = true;
  cfg.dest_loop_start = dest;
  cfg.dest_loop_end   = dest + slot_bytes;
  cfg.data_width      = BK7258_DMA_WIDTH_32BITS;

  /* Burst lengths.  The vendor uses SINGLE on the FIFO side and INC16 into
   * memory (dvp_camera_dma_config(), CONFIG_SPE branch); a FIFO source must
   * stay SINGLE because its address does not advance, so only the
   * destination is a knob.
   */

  cfg.src_burst       = BK7258_DMA_BURST_SINGLE;
  cfg.dest_burst      = CONFIG_BK7258_CAMERA_JPEG_DMA_DEST_BURST;

  /* Cleared here because the delivered length of the next frame is counted
   * from this point: arming resets the destination to the top of the buffer.
   */

  priv->jpeg_frame_chunks = 0;
  priv->jpeg_ring_chunks = 0;
  priv->jpeg_ring_read = 0;

  if (bk7258_dma_configure_ex(&cfg) == 0)
    {
      bk7258_dma_start_channel(BK7258_CAMERA_JPEG_DMA_CH);
    }
}

/****************************************************************************
 * Name: bk7258_camera_jpeg_ring_write_pos
 *
 * Description:
 *   Where the DMA is currently writing, as an offset into the ring.
 *
 *   The destination address register cannot be used for this: it holds the
 *   programmed start and does not advance while the channel runs (measured --
 *   over six frames it read back exactly the base address every time).  So
 *   the position is reconstructed from the chunk interrupts, which is sound
 *   only because the channel is never restarted: the counter is cumulative
 *   for the whole session.
 *
 *   Interrupts are masked over the two reads because a chunk interrupt
 *   landing between them would mismatch the counter with remain_len and put
 *   the position out by a whole chunk.
 *
 ****************************************************************************/

