open-vela/contest2026_264_VelaSightsuixingAIzhinengyanjing/board/beken/chips/bk7258/bk7258_camera_imgdata.c
static uint32_t bk7258_camera_jpeg_ring_write_pos(
    FAR struct bk7258_camera_imgdata_s *priv, FAR bool *finish_pending)
{
  irqstate_t flags = up_irq_save();
  uint32_t chunks;
  uint32_t remain;
  bool pending;
  uint64_t total;

  bk7258_dma_get_channel_progress(BK7258_CAMERA_JPEG_DMA_CH, &remain,
                                  &pending);
  chunks = priv->jpeg_ring_chunks;

  up_irq_restore(flags);

  if (finish_pending != NULL)
    {
      *finish_pending = pending;
    }

  if (remain > BK7258_CAMERA_JPEG_CHUNK)
    {
      remain = BK7258_CAMERA_JPEG_CHUNK;
    }

  /* Deliberately do not compensate for pending here in the diagnostic build.
   * The pending mask and delta printed at stop_capture prove or falsify the
   * one-chunk ownership hypothesis before the behavior is changed.
   */

  total = (uint64_t)chunks * BK7258_CAMERA_JPEG_CHUNK +
          (BK7258_CAMERA_JPEG_CHUNK - remain);

  return (uint32_t)(total % (priv->jpeg_ring_bytes /
                             BK7258_CAMERA_JPEG_RING_SLOTS));
}

/****************************************************************************
 * Name: bk7258_camera_jpeg_chunk_done
 *
 * Description:
 *   One DMA chunk moved.  Counting only: in REPEAT mode this interrupt is a
 *   progress report, not an end of transfer.
 *
 *   A handler must be registered even though nothing needs doing, because
 *   the DMA driver only services -- and therefore only acknowledges the
 *   finish interrupt of -- channels that have one.  Without it the channel's
 *   finish bit would stay set and the level-sensitive line would never
 *   release.  Interrupt context: counters only.
 *
 ****************************************************************************/

static void bk7258_camera_jpeg_chunk_done(FAR void *arg)
{
  FAR struct bk7258_camera_imgdata_s *priv = arg;

  priv->jpeg_chunks++;
  priv->jpeg_frame_chunks++;
  priv->jpeg_ring_chunks++;
}

/****************************************************************************
 * Name: bk7258_camera_jpeg_validate_work
 *
 * Description:
 *   Finish one hardware JPEG after the EOF handler copied it out of the DMA
 *   ring.  Exact Huffman/MCU validation walks the complete entropy stream;
 *   doing that in the JPEG ISR delayed DMA chunk accounting long enough to
 *   lose the next ring position (measured as one delivered frame followed by
 *   no_soi=151).  Running it on bk7258_camera_jpeg_thread() instead keeps the
 *   ring's interrupt-side bookkeeping live.
 *
 *   The V4L2 buffer remains owned by the driver until capture_cb() runs, and
 *   EOF drops newer frames while jpeg_encoding is true, so this task has
 *   exclusive access to frame_buf without another allocation or copy.
 ****************************************************************************/

static void bk7258_camera_jpeg_validate_work(FAR void *arg)
{
  FAR struct bk7258_camera_imgdata_s *priv = arg;
  uint32_t hdrlen;
  uint32_t frame_len;
  size_t entropy_len;
  clock_t validate_start;
  clock_t mark;
  int bitshift;
  int result = EIO;

  if (!priv->capturing || priv->frame_buf == NULL)
    {
      priv->jpeg_encoding = false;
      return;
    }

  mark = up_perf_gettime();
  hdrlen = (uint32_t)bk7258_jpeg_enc_write_header(priv->frame_buf,
                                                   BK7258_JPEG_ENC_PAD);
  priv->jpeg_hdr_cycles += up_perf_gettime() - mark;

  if (hdrlen == 0)
    {
      priv->jpeg_hdr_fail++;
      priv->jpeg_error = true;
    }
  else
    {
      entropy_len = (size_t)BK7258_JPEG_ENC_PAD + priv->jpeg_work_len -
                    2u - hdrlen;
      validate_start = clock_systime_ticks();

      /* Two attempts, cheap one first.
       *
       * A prefix walk reads the first CONFIG_BK7258_CAMERA_JPEG_VALIDATE_MCUS
       * macroblocks and nothing else, so it does not need the whole stream --
       * only somewhere fast to read those bytes from.  g_jpeg_prefix is that
       * place, and copying into it moves the walk off non-cacheable PSRAM,
       * which is where all of this frame's cost was.
       *
       * capacity == length is load-bearing and must stay that way.  It is what
       * makes this a read-only probe: realign_entropy_prefix() has no room to
       * write a shifted copy after the input, so it reports the shift as
       * -ENOSPC and leaves g_jpeg_prefix alone, which is the signal to take
       * the slow path rather than a failure.  Give it any headroom and it will
       * rewrite the stream in a 4 KB buffer sized for a prefix.
       *
       * The slow path is the original one, unchanged: whole stream into the
       * heap scratch, walk it there, copy back if a shift was applied.  It
       * runs when the prefix is too small to settle the alignment, when a
       * shift is needed, or when the frame is genuinely bad -- and it is what
       * decides the frame's fate in all of those cases, so shrinking the
       * prefix can cost time but cannot reject a frame that would otherwise
       * have been accepted.
       */

      bitshift = -EAGAIN;

      if (entropy_len != 0)
        {
          size_t prefix_len = entropy_len < sizeof(g_jpeg_prefix) ?
                              entropy_len : sizeof(g_jpeg_prefix);
          size_t walk_len = prefix_len;

          mark = up_perf_gettime();
          memcpy(g_jpeg_prefix, priv->frame_buf + hdrlen, prefix_len);
          priv->jpeg_prefix_cycles += up_perf_gettime() - mark;

          mark = up_perf_gettime();
          bitshift = bk7258_jpeg_realign_entropy_prefix(
            g_jpeg_prefix, &walk_len, prefix_len,
            priv->width, priv->height,
            CONFIG_BK7258_CAMERA_JPEG_VALIDATE_MCUS);
          priv->jpeg_realign_cycles += up_perf_gettime() - mark;

          if (bitshift != 0)
            {
              /* Anything other than "already aligned" has to be settled by
               * the full walk below, including -EBADMSG: a prefix that did
               * not decode may be a bad frame or may just be too short.
               */

              priv->jpeg_prefix_miss++;
              bitshift = -EAGAIN;
            }
        }

