open-vela/contest2026_264_VelaSightsuixingAIzhinengyanjing/board/beken/chips/bk7258/bk7258_camera_imgdata.c
      if (bitshift == -EAGAIN)
        {
          if (entropy_len > priv->jpeg_validate_scratch_bytes)
            {
              bitshift = -ENOSPC;
            }
          else
            {
              mark = up_perf_gettime();
              memcpy(priv->jpeg_validate_scratch,
                     priv->frame_buf + hdrlen, entropy_len);
              priv->jpeg_scratch_cycles += up_perf_gettime() - mark;

              mark = up_perf_gettime();
              bitshift = bk7258_jpeg_realign_entropy_prefix(
                priv->jpeg_validate_scratch, &entropy_len,
                priv->jpeg_validate_scratch_bytes, priv->width, priv->height,
                CONFIG_BK7258_CAMERA_JPEG_VALIDATE_MCUS);
              priv->jpeg_realign_cycles += up_perf_gettime() - mark;

              if (bitshift > 0)
                {
                  mark = up_perf_gettime();
                  memcpy(priv->frame_buf + hdrlen,
                         priv->jpeg_validate_scratch, entropy_len);
                  priv->jpeg_scratch_cycles += up_perf_gettime() - mark;
                }
            }
        }

      priv->jpeg_validate_ticks +=
        (uint32_t)(clock_systime_ticks() - validate_start);
      priv->jpeg_validate_runs++;

      if (bitshift < 0)
        {
          priv->jpeg_bit_fail++;
          priv->jpeg_error = true;
        }
      else
        {
          frame_len = hdrlen + (uint32_t)entropy_len + 2u;
          priv->frame_buf[frame_len - 2u] = 0xff;
          priv->frame_buf[frame_len - 1u] = 0xd9;

          if (bitshift > 0)
            {
              priv->jpeg_bit_fixed++;
            }

          if (priv->jpeg_work_finish_pending && priv->frames_done < 32u)
            {
              priv->jpeg_pending_mask |= 1u << priv->frames_done;
            }

          priv->frames_done++;
          result = 0;
        }
    }

  if (priv->capturing && priv->capture_cb != NULL)
    {
      priv->capture_cb(result, result == 0 ? frame_len : 0,
                       &priv->jpeg_work_ts, priv->capture_cb_arg);
    }

  /* Keep the guard set through capture_cb(): complete_capture() synchronously
   * supplies the next V4L2 buffer, and an EOF interrupt inside that handoff
   * must still drop rather than write into the buffer being returned.
   */

  priv->jpeg_encoding = false;

  if (priv->capturing)
    {
      bk7258_camera_watchdog_arm(priv);
    }
}

/****************************************************************************
 * Name: bk7258_camera_jpeg_eof
 *
 * Description:
 *   One encoded frame finished.  Runs in interrupt context (the JPEG block's
 *   EOF interrupt) and must not print, block or allocate.
 *
 *   Sequence, and why it is this order (reference:
 *   dvp_camera_jpeg_eof_handler()):
 *
 *     1. Flush the DMA's source side.  The last bytes of a frame do not
 *        land on a 32-bit boundary, and without this they stay in the
 *        channel and the frame is short by up to three bytes.
 *     2. Stop the channel, so nothing more is written while the buffer is
 *        handed over.
 *     3. Take the length from byte_count_pfrm, which the hardware counted
 *        while encoding.
 *     4. Confirm the frame ends in FF D9 and trim to it.  This is the one
 *        cheap check that the bitstream really arrived whole; a frame
 *        without it is reported as an error rather than passed off as a
 *        JPEG that no decoder will open.
 *
 ****************************************************************************/

static void bk7258_camera_jpeg_eof(FAR void *arg, uint32_t bytes)
{
  FAR struct bk7258_camera_imgdata_s *priv = arg;

  /* The bitstream is copied to PAD bytes into the V4L2 buffer, leaving room
   * for the standards-conforming header, so every offset below -- delivered,
   * the EOI search, the recorded tail -- is relative to that, not to the
   * buffer.
   */

  FAR uint8_t *buf = priv->frame_buf == NULL ? NULL :
                     priv->frame_buf + BK7258_JPEG_ENC_PAD;
  FAR uint8_t *raw;
  uint32_t slot_bytes;
  uint32_t capacity;
  uint32_t write_pos;
  struct timeval ts;
  uint32_t len = 0;
  uint32_t delivered;
  uint32_t i;
  bool finish_pending;

  if (!priv->capturing || priv->frame_buf == NULL)
    {
      return;
    }

  /* Wait for the tail of the frame to actually arrive.
   *
   * EOF means the encoder stopped producing, not that the bitstream reached
   * memory: the output FIFO still holds a few hundred bytes, and flushing
   * the DMA's own source buffer does not move them (that only pushes the
   * partial word held inside the channel).  Examined at EOF, the buffer ends
   * mid-entropy-data with no end-of-image marker -- measured: at the
   * reported 7515 bytes the memory read f7 5f fb e7 ff 00 af 46, i.e. the
   * stream carried on.
   *
   * The wait is bounded because this runs in interrupt context.  The drain
   * is a few hundred bytes at one 32-bit word per request, so it finishes in
   * microseconds; the bound only stops a stalled bus from wedging the
   * handler.
   */

  for (i = 0; i < BK7258_CAMERA_JPEG_DRAIN_SPINS; i++)
    {
      if (bk7258_jpeg_enc_fifo_empty())
        {
          break;
        }
    }

  if (i > priv->jpeg_drain_spins_max)
    {
      priv->jpeg_drain_spins_max = i;
    }

  priv->jpeg_drain_spins_sum += i;

  if (i >= BK7258_CAMERA_JPEG_DRAIN_SPINS)
    {
      /* The FIFO never reported empty.  The frame is very likely short, so
       * let the VSYNC handler reset rather than trusting the span.
       */

      priv->jpeg_drain_timeouts++;
      priv->jpeg_error = true;
    }

  /* Match the vendor frame boundary: flush the partial DMA word, stop the
   * channel, snapshot its completed slot, and restart into a fresh slot
   * before doing any copy or validation.  Earlier stop/re-arm attempts used
   * the same destination and waited for V4L2, losing bytes produced in that
   * gap; slot switching has neither failure mode.
   */

  bk7258_dma_flush_src_buffer(BK7258_CAMERA_JPEG_DMA_CH);
  bk7258_dma_stop_channel(BK7258_CAMERA_JPEG_DMA_CH);

  write_pos = bk7258_camera_jpeg_ring_write_pos(priv, &finish_pending);
  slot_bytes = priv->jpeg_ring_bytes / BK7258_CAMERA_JPEG_RING_SLOTS;
  raw = priv->jpeg_ring + (uint32_t)priv->jpeg_ring_slot * slot_bytes;
  delivered = write_pos;
  priv->jpeg_ring_read = 0;

  priv->jpeg_ring_slot = (uint8_t)(
    ((unsigned int)priv->jpeg_ring_slot + 1u) %
    BK7258_CAMERA_JPEG_RING_SLOTS);
  bk7258_camera_jpeg_dma_arm(priv);

  if (finish_pending)
    {
      priv->jpeg_finish_pending++;
      priv->jpeg_pending_delta = (int32_t)delivered - (int32_t)bytes;
    }

  /* Resynchronise on the frame's own SOI.
   *
   * The read pointer is left at the write position when a frame is delivered
   * or skipped, but the encoder's last bytes for that frame reach memory
   * *after* that -- the FIFO drain is not instantaneous however long the
   * handler spins.  Those leftovers become the head of the next span, so the
   * next frame's entropy data starts a few bytes late.
   *
   * The effect is nasty precisely because it still decodes: every marker is
   * present (the header is synthesised) and the picture looks plausible, but
   * its content is displaced -- measured as a best match at 32 and 56 rows
   * of vertical offset with correlation 0.5-0.6, against 1.00 and zero offset
   * for a good frame -- and its DC and chroma come out wrong, which shows up
   * as an over-bright, colour-shifted frame roughly one in three.
   *
   * Every frame this block emits begins SOI + APP0, so skipping to the first
   * FF D8 in the span is an exact resynchronisation.
   */

  if (delivered >= 4u)
    {
      uint32_t scan;
      uint32_t limit = delivered - 1u < BK7258_CAMERA_JPEG_SOI_SCAN ?
                       delivered - 1u : BK7258_CAMERA_JPEG_SOI_SCAN;

      for (scan = 0; scan < limit; scan++)
        {
          if (raw[scan] == 0xffu && raw[scan + 1u] == 0xd8u)
            {
              break;
            }
        }

      if (scan < limit)
        {
          priv->jpeg_ring_read = scan;
          delivered -= scan;
          priv->jpeg_resync += scan != 0 ? 1u : 0u;
        }
      else
        {
          /* No frame start in the window: drop the span rather than deliver
           * a displaced picture.
           */

          priv->jpeg_no_soi++;
          priv->jpeg_error = true;
          priv->jpeg_ring_read = write_pos;

          if (priv->capturing)
            {
              bk7258_camera_watchdog_arm(priv);
            }

          return;
        }
    }

  /* The vendor's integrity check, on the span that is about to be delivered.
   *
   * dvp_camera_jpeg_eof_handler() compares what the DMA moved against the
   * hardware's own byte_count_pfrm and, when they disagree by anything short
   * of a whole chunk, flags the frame and lets the next VSYNC reset the
   * pipeline.  It costs one subtraction and catches the class of fault a
   * Huffman walk cannot see: a span that lost bytes, or picked up a
   * neighbour's.
   */

