open-vela/contest2026_264_VelaSightsuixingAIzhinengyanjing/board/beken/chips/bk7258/bk7258_camera_imgdata.c
  priv->jpeg_recon_delta = (int32_t)delivered - (int32_t)bytes -
                           (int32_t)BK7258_JPEG_ENC_CRC_SIZE;

  if (priv->jpeg_recon_delta > priv->jpeg_recon_worst ||
      -priv->jpeg_recon_delta > priv->jpeg_recon_worst)
    {
      priv->jpeg_recon_worst = priv->jpeg_recon_delta < 0 ?
                               -priv->jpeg_recon_delta :
                               priv->jpeg_recon_delta;
    }

  if (priv->jpeg_recon_delta > BK7258_CAMERA_JPEG_RECON_SLACK ||
      priv->jpeg_recon_delta < -BK7258_CAMERA_JPEG_RECON_SLACK)
    {
      priv->jpeg_recon_bad++;

#ifdef CONFIG_BK7258_CAMERA_JPEG_RECONCILE
      priv->jpeg_error = true;
      priv->jpeg_ring_read = write_pos;

      if (priv->capture_cb != NULL)
        {
          bk7258_camera_now(&ts);
          priv->capture_cb(EIO, 0, &ts, priv->capture_cb_arg);
        }

      if (priv->capturing)
        {
          bk7258_camera_watchdog_arm(priv);
        }

      return;
#endif
    }

  capacity = priv->frame_buf_size > BK7258_JPEG_ENC_PAD ?
             priv->frame_buf_size - BK7258_JPEG_ENC_PAD : 0;

  if (delivered > capacity)
    {
      /* A frame bigger than the V4L2 buffer, or a span the ring wrapped
       * over.  Either way the data is not trustworthy; resynchronise on the
       * current position rather than deliver part of a frame.
       */

      priv->jpeg_ring_over++;
      priv->jpeg_error = true;
      priv->jpeg_ring_read = write_pos;


      if (priv->capture_cb != NULL)
        {
          bk7258_camera_now(&ts);
          priv->capture_cb(EIO, 0, &ts, priv->capture_cb_arg);
        }

      if (priv->capturing)
        {
          bk7258_camera_watchdog_arm(priv);
        }

      return;
    }

  if (priv->jpeg_encoding)
    {
      /* Exact entropy validation owns frame_buf until the JPEG thread
       * finishes with it.  The DMA ring is independent and must keep
       * advancing; dropping this newest frame is cheaper and safer than
       * queuing work behind an old V4L2 buffer.
       *
       * This is also the counter to watch after the validator moved below the
       * UI in priority: it grows when the validator falls behind, which is the
       * intended failure mode rather than a fault.
       */

      priv->jpeg_ring_read = write_pos;
      priv->jpeg_hw_busy++;

      if (priv->capturing)
        {
          bk7258_camera_watchdog_arm(priv);
        }

      return;
    }

  /* Fixed sampling rate, applied before the copy.
   *
   * The encoder runs at the sensor rate whatever we do, so pacing happens by
   * choosing which completed frames to deliver.  Skipping here rather than
   * after the copy also keeps the interrupt handler cheap: at 5 FPS five out
   * of six frames cost only a pointer update instead of a 25KB memcpy.
   *
   * Advancing the read pointer past a skipped frame is what makes the next
   * delivered frame the newest one rather than a queued old one -- the
   * spec's drop-the-oldest rule.
   */

  if ((sclock_t)(clock_systime_ticks() - priv->jpeg_next_sample) < 0)
    {
      /* Discard the frame by moving the read pointer past it.  Leaving the
       * pointer where it was instead makes the skipped frames pile up in the
       * ring, and the next delivered span then covers all of them: measured
       * as a 150611-byte "frame" and ring_over=3 at 5 FPS before this line
       * existed.
       */

      priv->jpeg_ring_read = write_pos;
      priv->jpeg_sw_skipped++;

      if (priv->capturing)
        {
          bk7258_camera_watchdog_arm(priv);
        }

      return;
    }

  priv->jpeg_next_sample = clock_systime_ticks() + priv->jpeg_sample_period;

  /* The completed slot is frozen and one frame is smaller than a slot, so
   * this copy cannot wrap or race the DMA now writing the next slot.
   */

  if (delivered > 0)
    {
      clock_t mark = up_perf_gettime();

      memcpy(buf, raw + priv->jpeg_ring_read, delivered);
      priv->jpeg_copy_cycles += up_perf_gettime() - mark;
    }

  priv->jpeg_ring_read = write_pos;


  if (delivered >= 2u)
    {
      /* Search a window around the reported length rather than only below
       * it.  byte_count_pfrm is the hardware's count for the frame, but it
       * is not necessarily the file length: the marker turned out to sit
       * *past* it on this board, so a search that only looks backwards (as
       * the reference's does) rejects every frame.  The delta is recorded
       * below so the relationship is documented by measurement rather than
       * assumed.
       *
       * Scanning forward is safe: JPEG byte-stuffs every FF inside entropy
       * data as FF 00, so a bare FF D9 can only be the end-of-image marker.
       */

      /* Scan back from the end of what was delivered.  The encoder appends
       * 5 CRC bytes after the marker (JPEG_CRC_SIZE), and the last chunk is
       * accounted in whole words, so the marker sits a few bytes short of
       * the delivered count rather than exactly at it.  Scanning backwards
       * is safe: JPEG byte-stuffs every FF inside entropy data as FF 00, so
       * a bare FF D9 can only be the end-of-image marker.
       */

      uint32_t lo = delivered > BK7258_CAMERA_JPEG_EOI_BACK ?
                    delivered - BK7258_CAMERA_JPEG_EOI_BACK : 2u;

      for (i = delivered; i >= lo; i--)
        {
          if (buf[i - 1] == 0xd9u && buf[i - 2] == 0xffu)
            {
              len = i;
              priv->jpeg_eoi_delta = (int32_t)len - (int32_t)bytes;
              break;
            }
        }
    }

  bk7258_camera_now(&ts);

  if (len == 0)
    {
      priv->jpeg_short++;
      priv->jpeg_error = true;

      /* Record what is actually at the reported length, so the next run says
       * what the encoder produced instead of guessing at it.
       */

      if (delivered >= 4u && delivered + 4u <= capacity)
        {
          uint32_t k;

          priv->jpeg_tail_at = delivered;
          for (k = 0; k < 8u; k++)
            {
              priv->jpeg_tail[k] = buf[delivered - 4u + k];
            }
        }

      if (priv->capture_cb != NULL)
        {
          priv->capture_cb(EIO, 0, &ts, priv->capture_cb_arg);
        }
    }
  else
    {
      /* Keep the V4L2 buffer owned and hand the complete raw frame to
       * task context.  All ring state was advanced before this point, so
       * subsequent DMA/EOF interrupts can continue independently.
       */

