open-vela/contest2026_264_VelaSightsuixingAIzhinengyanjing/board/beken/chips/bk7258/bk7258_camera_imgdata.c
      priv->jpeg_work_len = len;
      priv->jpeg_work_finish_pending = finish_pending;
      priv->jpeg_work_ts = ts;
      priv->jpeg_encoding = true;

      if (bk7258_camera_jpeg_post(priv,
                                  bk7258_camera_jpeg_validate_work) < 0)
        {
          priv->jpeg_encoding = false;
          priv->jpeg_bit_fail++;

          if (priv->capture_cb != NULL)
            {
              priv->capture_cb(EIO, 0, &ts, priv->capture_cb_arg);
            }
        }
    }

  if (priv->capturing)
    {
      /* Nothing to re-arm: the channel runs for the whole session.  An
       * earlier version re-armed here, and an earlier one still waited for
       * set_buf() to do it -- which never came for a frame completed with an
       * error, so the channel died on the first bad frame (both runs stopped
       * at exactly 7 chunks, ~72KB, whatever the frame rate).
       */

      bk7258_camera_watchdog_arm(priv);
    }
}

/****************************************************************************
 * Name: bk7258_camera_jpeg_vsync
 *
 * Description:
 *   Frame boundary, in interrupt context.  Recovers the encoder if it gave
 *   up on the frame that just went past.
 *
 *   Why this is needed at all: the sensor streams continuously, so the
 *   encoder is always enabled somewhere in the middle of a frame and its
 *   first frame is a fragment.  Left alone it stays wedged -- measured on
 *   this board, 28 frames started, 26 raised frame_err, exactly one reached
 *   EOF and that one was 3.5KB with no end-of-image marker.  The reference
 *   handles this the same way: its VSYNC handler calls
 *   dvp_camera_reset_hardware_modules_handler() whenever an error is
 *   flagged, which is where this sequence comes from.
 *
 *   The sequence matters: both modules are stopped before either is reset,
 *   the drain is restarted before the producers, and the encoder is enabled
 *   last, so it comes up on a frame boundary rather than mid-frame.
 *
 *   Every call here is register-only and print-free.  The encoder's
 *   configuration survives its soft reset (the reference does not
 *   reprogram it either), so recovery costs no I2C and no table writes.
 *
 ****************************************************************************/

static void bk7258_camera_jpeg_vsync(FAR void *arg)
{
  FAR struct bk7258_camera_imgdata_s *priv = arg;
  struct bk7258_jpeg_enc_stats_s st;

  if (!priv->capturing || !priv->jpeg)
    {
      return;
    }

  priv->jpeg_vsyncs++;

  bk7258_jpeg_enc_get_stats(&st);

  /* Two sources, one recovery.  The encoder's own frame_err counter is what
   * this handler was built on; jpeg_error is everything the drain side
   * decided was out of step -- a span with no SOI, a length the hardware
   * disagrees with, a frame that never showed an end-of-image marker.  The
   * vendor funnels all of them into a single flag for exactly this reason
   * (dvp_driver_handle_t::error, cleared in the vendor's own
   * dvp_camera_vsync_negedge_handler()): recovering anywhere other than a
   * frame boundary reproduces the phase problem it is trying to clear.
   */

  if (st.err_count == priv->jpeg_err_seen && !priv->jpeg_error)
    {
      return;
    }

  priv->jpeg_err_seen = st.err_count;
  priv->jpeg_error = false;
  priv->jpeg_resets++;

  bk7258_yuv_buf_stop();
  bk7258_jpeg_enc_stop();

  bk7258_jpeg_enc_soft_reset();
  bk7258_yuv_buf_soft_reset();

  bk7258_dma_stop_channel(BK7258_CAMERA_JPEG_DMA_CH);
  bk7258_camera_jpeg_dma_arm(priv);

  bk7258_yuv_buf_start_jpeg();
  bk7258_jpeg_enc_start();
}

/****************************************************************************
 * Name: bk7258_camera_set_sw_jpeg
 *
 * Description:
 *   Register the software JPEG encoder used as the V4L2_PIX_FMT_JPEG
 *   correctness fallback.  With CONFIG_BK7258_CAMERA_HW_JPEG, formats up to
 *   640 pixels wide use validated hardware output and wider formats use this
 *   encoder; without it, all JPEG formats use software.
 *
 *   Why a hook rather than a direct call: the encoder is libjpeg-turbo, which
 *   lives in the apps tree and is linked by the board layer
 *   (boards/.../src/bk7258_jpeg_enc.c).  Calling it from here would make this
 *   chip driver depend on both, inverting the direction every other file in
 *   this tree follows (board calls chip).  The board registers itself at
 *   bring-up instead.
 *
 *   Why software remains registered: the repaired hardware path is decoded-
 *   pixel verified at 480x480 and 640x480, and rejects structurally invalid
 *   entropy fail-closed.  At 864x480 its syntax validated but decoded pixels
 *   were unstable, so that width deliberately uses the slower, correct
 *   software encoder.
 *
 ****************************************************************************/

static bk7258_camera_sw_jpeg_t g_sw_jpeg;

void bk7258_camera_set_sw_jpeg(bk7258_camera_sw_jpeg_t encoder)
{
  g_sw_jpeg = encoder;
}

/****************************************************************************
 * Name: bk7258_camera_sw_jpeg_work
 *
 * Description:
 *   Encode the staged raw frame into the application's buffer and complete
 *   it.  Work-queue context, so printf and long work are both allowed.
 *
 ****************************************************************************/

static void bk7258_camera_sw_jpeg_work(FAR void *arg)
{
  FAR struct bk7258_camera_imgdata_s *priv = arg;
  struct timeval ts;
  int len;

  if (!priv->capturing || priv->frame_buf == NULL || g_sw_jpeg == NULL)
    {
      priv->jpeg_encoding = false;
      priv->jpeg_buf_armed = priv->capturing && priv->frame_buf != NULL;
      return;
    }

  /* Capacity comes from set_buf(), not from frame_bytes: start_capture()
   * deliberately zeroes frame_bytes for encoded formats (the length is
   * whatever the encoder produces, so there is no per-frame size), and the
   * first frame of a session used to be encoded with dstlen == 0 and
   * completed with V4L2_BUF_FLAG_ERROR -- visible to the application as
   * "frame 0: bytesused=0 flags=0x00000040".
   */

