open-vela/contest2026_264_VelaSightsuixingAIzhinengyanjing/board/beken/chips/bk7258/bk7258_camera_imgdata.c
  /* Every exit from here that does not complete a buffer has to give the
   * arm back.
   *
   * bk7258_camera_frame_done() clears jpeg_buf_armed when it queues this
   * work, on the assumption that the work will consume the buffer -- either
   * by delivering a frame or by completing it with an error.  An exit that
   * does neither leaves the driver with armed == false and the framework
   * with a buffer it believes is still being filled, and nothing ever
   * re-arms: the framework only calls set_buf() after a completion.  The
   * session then delivers exactly one frame and stalls, which is what
   * "no frame within 5000 ms" was, with set_buf_live=1 armed=0 encoding=0.
   */

  if (priv->frame_buf_size == 0)
    {
      priv->jpeg_encoding = false;
      priv->jpeg_buf_armed = priv->capturing;
      return;
    }

  if (priv->jpeg_raw_ready < 0 ||
      priv->jpeg_raw[priv->jpeg_raw_ready] == NULL)
    {
      priv->jpeg_encoding = false;
      priv->jpeg_buf_armed = priv->capturing;
      return;
    }

  len = g_sw_jpeg(priv->jpeg_raw[priv->jpeg_raw_ready], priv->jpeg_raw_bytes,
                  priv->frame_buf, priv->frame_buf_size,
                  priv->width, priv->height);

  bk7258_camera_now(&ts);

  if (len > 0 && priv->jpeg_sw_frames == 0)
    {
      /* First frame of the session only: prove the encoded file is in the
       * buffer the application will read, not merely reported.
       */

      printf("bk7258_camera_imgdata: sw_jpeg first frame len=%d "
             "dst[0..3]=%02x %02x %02x %02x tail=%02x %02x\n",
             len, priv->frame_buf[0], priv->frame_buf[1],
             priv->frame_buf[2], priv->frame_buf[3],
             priv->frame_buf[len - 2], priv->frame_buf[len - 1]);
    }

  if (len > 0)
    {
      priv->jpeg_sw_frames++;
      priv->frames_done++;

      if (priv->capture_cb != NULL)
        {
          priv->capture_cb(0, (uint32_t)len, &ts, priv->capture_cb_arg);
        }
    }
  else
    {
      if (priv->capture_cb != NULL)
        {
          priv->capture_cb(EIO, 0, &ts, priv->capture_cb_arg);
        }
    }

  priv->jpeg_encoding = false;
}

/****************************************************************************
 * Name: bk7258_camera_jpeg_post
 *
 * Description:
 *   Hand one JPEG completion to the thread.  Interrupt context: stores the
 *   handler and posts, nothing else.
 *
 *   The caller has already set jpeg_encoding, which is what keeps a second
 *   interrupt from overwriting jpeg_handler while the thread is between the
 *   wait and the read -- an interrupt that finds the flag set never gets
 *   here.
 *
 ****************************************************************************/

static int bk7258_camera_jpeg_post(FAR struct bk7258_camera_imgdata_s *priv,
                                   CODE void (*handler)(FAR void *arg))
{
  if (priv->jpeg_pid <= 0)
    {
      return -ENXIO;
    }

  priv->jpeg_handler = handler;
  return nxsem_post(&priv->jpeg_sem);
}

/****************************************************************************
 * Name: bk7258_camera_jpeg_thread
 *
 * Description:
 *   Runs whichever JPEG completion the last interrupt asked for, at
 *   BK7258_CAMERA_JPEG_PRIORITY.  See that definition for why this is not
 *   LPWORK.
 *
 *   Started on the first init() and never stopped: it owns no frame state
 *   between posts, so parking it on the semaphore across a close costs a
 *   stack and nothing else, and that is cheaper than getting create/join
 *   right on every stream open.  uninit() drains instead -- see the wait
 *   there.
 *
 ****************************************************************************/

static int bk7258_camera_jpeg_thread(int argc, FAR char *argv[])
{
  FAR struct bk7258_camera_imgdata_s *priv = &g_bk7258_camera_imgdata;

  for (; ; )
    {
      CODE void (*handler)(FAR void *arg);

      if (nxsem_wait_uninterruptible(&priv->jpeg_sem) < 0)
        {
          continue;
        }

      handler = priv->jpeg_handler;
      priv->jpeg_handler = NULL;

      if (handler != NULL)
        {
          handler(priv);
        }
    }

  return 0;
}

/****************************************************************************
 * Name: bk7258_camera_frame_done
 *
 * Description:
 *   YUV_BUF frame-done (YUV_ARV) callback -- interrupt context, one call
 *   per completed frame already written into priv->frame_buf by the
 *   hardware.  Reports the frame to the V4L2 framework, which re-arms the
 *   next buffer through set_buf().  Must stay print-free.
 *
 ****************************************************************************/

static void bk7258_camera_frame_done(FAR void *arg)
{
  FAR struct bk7258_camera_imgdata_s *priv = arg;
  struct timeval ts;

  if (!priv->capturing || priv->frame_buf == NULL)
    {
      return;
    }

  /* In JPEG mode this event still arrives -- YUV_BUF's VSYNC/YUV_ARV
   * interrupts stay enabled because the watchdog uses them as the "sensor is
   * alive" marker -- but it must not complete a buffer: the module's frame
   * writer is switched off, so the buffer holds no image, and the encoded
   * frame is reported by bk7258_camera_jpeg_eof() instead.  Completing here
   * is what handed the application a whole buffer of uninitialised PSRAM on
   * the first JPEG attempt.
   */

  if (priv->jpeg)
    {
      /* Software JPEG: the frame really is in memory (YUV_BUF's own writer is
       * on in this mode), so hand it to the work queue.  Frames that arrive
       * while an encode is still running are dropped rather than queued: at
       * ~270ms per encode and 33ms per frame there would always be a backlog,
       * and the newest frame is the one worth having.
       */

      if (priv->jpeg_software)
        {
          /* Encode only when the framework is actually waiting for a frame.
           * Encoding on every frame instead wasted most of the work: the
           * first version encoded 141 frames in a session where the
           * application received 6, because a completion with no queued
           * buffer is discarded -- and each of those is ~270ms of CPU.
           */

