open-vela/contest2026_264_VelaSightsuixingAIzhinengyanjing/board/beken/chips/bk7258/bk7258_camera_imgdata.c
          clock_t now = clock_systime_ticks();

          /* The frame that just completed is the newest one; hand the
           * hardware the other buffer and remember this one.  If an older
           * unprocessed frame was sitting here it is simply forgotten, which
           * is the drop-the-oldest rule.
           */

          if (priv->jpeg_raw_ready == (int8_t)priv->jpeg_raw_fill)
            {
              priv->jpeg_sw_drops++;
            }

          priv->jpeg_raw_ready = (int8_t)priv->jpeg_raw_fill;
          priv->jpeg_raw_fill ^= 1u;

          if (priv->jpeg_raw[priv->jpeg_raw_fill] != NULL)
            {
              bk7258_yuv_buf_set_frame_buffer(
                (uint32_t)(uintptr_t)priv->jpeg_raw[priv->jpeg_raw_fill]);
            }

          /* Fixed sampling rate, not "as fast as the encoder manages": the
           * product spec fixes the rate so cloud-side timestamps line up, and
           * a free-running encoder would also hold the low-priority work
           * queue continuously.
           */

          priv->jpeg_last_now = now;

          if (priv->jpeg_encoding)
            {
              priv->jpeg_sw_busy++;
            }
          else if (!priv->jpeg_buf_armed)
            {
              priv->jpeg_sw_nobuf++;
            }
          else if ((sclock_t)(now - priv->jpeg_next_sample) < 0)
            {
              priv->jpeg_sw_skipped++;
            }
          else
            {
              /* Fixed period from the start of the encode, so the wait overlaps
               * the encode rather than following it.  Measuring from the
               * completion instead was tried and measured worse: 480x480 fell
               * from 4.39 to 2.26 fps, because encode and wait then add up.
               */

              priv->jpeg_next_sample = now + priv->jpeg_sample_period;
              priv->jpeg_encoding = true;
              priv->jpeg_buf_armed = false;

              if (bk7258_camera_jpeg_post(priv,
                                          bk7258_camera_sw_jpeg_work) < 0)
                {
                  priv->jpeg_encoding = false;
                }
            }
        }

      bk7258_camera_watchdog_arm(priv);
      return;
    }

  priv->frames_done++;

  if (priv->capture_cb != NULL)
    {
      bk7258_camera_now(&ts);
      priv->capture_cb(0, priv->frame_buf_size, &ts, priv->capture_cb_arg);
    }

  if (priv->capturing)
    {
      bk7258_camera_watchdog_arm(priv);
    }
}

/****************************************************************************
 * Name: bk7258_camera_watchdog_expiry
 *
 * Description:
 *   No frame arrived within BK7258_CAMERA_WATCHDOG_MS.  Report an error
 *   frame so a blocked VIDIOC_DQBUF returns (with V4L2_BUF_FLAG_ERROR set
 *   on the buffer) instead of hanging the caller forever, then keep
 *   watching -- the hardware is left running so a late first frame is
 *   still captured.  Interrupt context: no printf().
 *
 ****************************************************************************/

static void bk7258_camera_watchdog_expiry(wdparm_t arg)
{
  FAR struct bk7258_camera_imgdata_s *priv =
      (FAR struct bk7258_camera_imgdata_s *)arg;
  struct timeval ts;

  if (!priv->capturing)
    {
      return;
    }

  if (priv->frames_done == priv->frames_at_arm)
    {
      priv->timeouts++;

      if (priv->capture_cb != NULL)
        {
          bk7258_camera_now(&ts);

          /* Non-zero result: complete_capture() marks the buffer
           * V4L2_BUF_FLAG_ERROR, completes it and posts dqbuf_wait_flg.
           */

          priv->capture_cb(EIO, 0, &ts, priv->capture_cb_arg);
        }
    }

  if (priv->capturing)
    {
      bk7258_camera_watchdog_arm(priv);
    }
}

static int bk7258_camera_imgdata_init(FAR struct imgdata_s *data)
{
  FAR struct bk7258_camera_imgdata_s *priv =
      (FAR struct bk7258_camera_imgdata_s *)data;

  printf("bk7258_camera_imgdata: init: entry\n");

  priv->capturing      = false;
  priv->frames_done    = 0;
  priv->frames_at_arm  = 0;
  priv->timeouts       = 0;
  priv->set_buf_calls  = 0;
  priv->rejected_bufs  = 0;
  priv->jpeg           = false;
  priv->jpeg_software  = false;
  priv->jpeg_chunks    = 0;
  priv->jpeg_short     = 0;
  priv->jpeg_err_seen  = 0;
  priv->jpeg_resets    = 0;
  priv->jpeg_stage     = NULL;
  priv->jpeg_stage_bytes = 0;
  priv->jpeg_validate_scratch = NULL;
  priv->jpeg_validate_scratch_bytes = 0;
  priv->jpeg_validate_ticks = 0;
  priv->jpeg_validate_runs = 0;
  priv->jpeg_hdr_fail  = 0;
  priv->jpeg_bit_fixed = 0;
  priv->jpeg_bit_fail  = 0;
  priv->jpeg_hw_busy   = 0;
  priv->jpeg_work_len  = 0;

  /* Brought up before the first interrupt source below, because an EOF that
   * arrives with no thread to hand the frame to reports an error frame.
   * Created once and kept: see bk7258_camera_jpeg_thread().
   */

  if (priv->jpeg_pid <= 0)
    {
      nxsem_init(&priv->jpeg_sem, 0, 0);
      priv->jpeg_handler = NULL;

      priv->jpeg_pid = kthread_create("bk7258_jpeg",
                                      BK7258_CAMERA_JPEG_PRIORITY,
                                      BK7258_CAMERA_JPEG_STACKSIZE,
                                      bk7258_camera_jpeg_thread, NULL);
      if (priv->jpeg_pid < 0)
        {
          printf("bk7258_camera_imgdata: init: JPEG thread failed: %d, "
                 "raw capture only\n", priv->jpeg_pid);
          priv->jpeg_pid = 0;
        }
      else
        {
          printf("bk7258_camera_imgdata: init: JPEG thread pid=%d prio=%d\n",
                 priv->jpeg_pid, BK7258_CAMERA_JPEG_PRIORITY);
        }
    }

  bk7258_yuv_buf_init();
  bk7258_yuv_buf_set_frame_callback(bk7258_camera_frame_done, priv);

  /* The JPEG path's two other pieces are brought up here rather than lazily
   * at the first JPEG stream, because both print and attach interrupts,
   * which is task-level work; start_capture() can be reached from a context
   * where that is not welcome.  Neither does anything until configured, and
   * a raw-YUV-only user pays one clock gate and one idle interrupt line.
   */

  bk7258_dma_init();

  if (bk7258_jpeg_enc_init() < 0)
    {
      printf("bk7258_camera_imgdata: init: JPEG encoder unavailable, "
             "raw capture only\n");
    }

  printf("bk7258_camera_imgdata: init: complete\n");

  return OK;
}

static int bk7258_camera_imgdata_uninit(FAR struct imgdata_s *data)
{
  FAR struct bk7258_camera_imgdata_s *priv =
      (FAR struct bk7258_camera_imgdata_s *)data;
  FAR const uint8_t *p = priv->frame_buf;

  priv->capturing = false;
  wd_cancel(&priv->watchdog);

  if (priv->jpeg)
    {
      /* Both JPEG paths hold frame_buf until they exit, and the framework may
       * unmap it as soon as this returns, so wait rather than cancel.  There
       * is nothing to cancel now that the work runs on a thread instead of on
       * LPWORK: a post already taken cannot be recalled.
       *
       * capturing was cleared above, which is what makes this bounded.  A
       * post the thread has not reached yet finds !capturing and returns
       * immediately; only a validation already walking an entropy stream has
       * to be waited out, and that is the 252 ms measured in
       * bk7258_jpeg_entropy.c.
       *
       * nxsig_usleep(), not a spin: the thread runs at
       * BK7258_CAMERA_JPEG_PRIORITY, which is below the priorities this close
       * path is reached from, so a caller that does not block would prevent
       * the very thread it is waiting for from running.
       */

      int spins = BK7258_CAMERA_JPEG_DRAIN_MS;

      while (priv->jpeg_encoding && spins-- > 0)
        {
          nxsig_usleep(1000);
        }

      if (priv->jpeg_encoding)
        {
          printf("bk7258_camera_imgdata: uninit: JPEG completion still busy "
                 "after %d ms, abandoning it\n", BK7258_CAMERA_JPEG_DRAIN_MS);
        }

      priv->jpeg_encoding = false;
    }

  if (priv->jpeg && !priv->jpeg_software)
    {
      /* Encoder first, then the channel that drains it: stopping the drain
       * while the encoder still produced output would leave the FIFO
       * filling with nobody reading it.
       */

      bk7258_yuv_buf_set_vsync_callback(NULL, NULL);
      bk7258_jpeg_enc_stop();
      bk7258_dma_stop_channel(BK7258_CAMERA_JPEG_DMA_CH);
    }

  bk7258_yuv_buf_stop();
  bk7258_yuv_buf_set_frame_callback(NULL, NULL);

  /* Task context (VIDIOC close path): safe to print, and this is the one
   * place that reports the whole session's outcome.  The first bytes of
   * the last frame buffer are dumped here because this board has no
   * filesystem big enough to save a 614400-byte frame (tmpfs lives in the
   * 336KB kernel heap), so a hexdump is the only way to confirm real
   * pixel data was captured rather than an all-zero buffer.
   */

  printf("bk7258_camera_imgdata: uninit: frames=%u timeouts=%u "
         "set_buf=%u rejected=%u\n",
         (unsigned int)priv->frames_done, (unsigned int)priv->timeouts,
         (unsigned int)priv->set_buf_calls,
         (unsigned int)priv->rejected_bufs);

  bk7258_yuv_buf_dump_status("uninit");

  if (p != NULL && priv->frames_done > 0)
    {
      printf("bk7258_camera_imgdata: uninit: frame[0..31] = "
             "%02x %02x %02x %02x %02x %02x %02x %02x "
             "%02x %02x %02x %02x %02x %02x %02x %02x "
             "%02x %02x %02x %02x %02x %02x %02x %02x "
             "%02x %02x %02x %02x %02x %02x %02x %02x\n",
             p[0], p[1], p[2], p[3], p[4], p[5], p[6], p[7],
             p[8], p[9], p[10], p[11], p[12], p[13], p[14], p[15],
             p[16], p[17], p[18], p[19], p[20], p[21], p[22], p[23],
             p[24], p[25], p[26], p[27], p[28], p[29], p[30], p[31]);
    }

  return OK;
}

