open-vela/contest2026_264_VelaSightsuixingAIzhinengyanjing/board/beken/chips/bk7258/bk7258_camera_imgdata.c
static int bk7258_camera_imgdata_set_buf(FAR struct imgdata_s *data,
                                          uint8_t nr_datafmts,
                                          FAR imgdata_format_t *datafmts,
                                          uint8_t *addr, uint32_t size)
{
  FAR struct bk7258_camera_imgdata_s *priv =
      (FAR struct bk7258_camera_imgdata_s *)data;
  uint32_t phys = (uint32_t)(uintptr_t)addr;
  uint32_t need;
  uint32_t span;

  /* How much of the buffer the hardware is allowed to use, and the least it
   * has to be given.
   *
   * Raw capture writes whole frames, so the buffer must hold exactly one and
   * the geometry fixes both numbers.  Encoded capture is the other way
   * round: the length is whatever the encoder produces, the buffer is
   * capacity, and the application chose it (see BK7258_CAMERA_JPEG_MIN_BUF).
   * The span keeps BK7258_JPEG_ENC_PAD for the header that gets written in
   * front of the bitstream, and what is left is rounded down to the drain
   * channel's transfer_len: the channel loops in whole steps, so a window
   * that is not a multiple of one would let the last step write past its
   * end, which is the one thing this bound exists to prevent.
   */

  if (priv->jpeg)
    {
      /* The drain window is the buffer minus the header reservation, and it
       * is that window -- not the buffer -- which has to be a whole number
       * of transfer_len steps, because the channel loops over it.
       */

      need = BK7258_CAMERA_JPEG_MIN_BUF;
      span = size > BK7258_JPEG_ENC_PAD ?
             BK7258_JPEG_ENC_PAD +
             ((size - BK7258_JPEG_ENC_PAD) / BK7258_CAMERA_JPEG_CHUNK) *
             BK7258_CAMERA_JPEG_CHUNK : 0;
    }
  else
    {
      need = priv->frame_bytes;
      span = priv->frame_bytes;
    }

  /* Interrupt context is possible here (v4l2_cap.c complete_capture()
   * re-arms the next buffer), so only report through counters unless
   * this is a task-level call.
   */

  if (addr == NULL || priv->width == 0 || span == 0 ||
      size < need ||
      phys < BK7258_CAMERA_PSRAM_BASE ||
      phys + span > BK7258_CAMERA_PSRAM_END)
    {
      priv->rejected_bufs++;

      if (!up_interrupt_context())
        {
          printf("bk7258_camera_imgdata: set_buf: rejected addr=%p "
                 "size=%u (need >=%u bytes inside PSRAM "
                 "0x%08x-0x%08x)\n",
                 addr, (unsigned int)size,
                 (unsigned int)need,
                 (unsigned int)BK7258_CAMERA_PSRAM_BASE,
                 (unsigned int)BK7258_CAMERA_PSRAM_END);
        }

      return -EINVAL;
    }

  priv->frame_bytes = span;
  priv->frame_buf = addr;
  priv->frame_buf_size = priv->frame_bytes;
  priv->set_buf_calls++;

  /* Separately count the calls that arrive while streaming.  set_buf_calls
   * alone cannot answer the question that matters when a session delivers
   * one frame and then stalls: whether the framework ever re-armed the
   * driver after a completion, or whether it did and the sampling gate
   * dropped the frame anyway.  The pre-STREAMON queueing is indis-
   * tinguishable from a re-arm in the total.
   */

  if (priv->capturing)
    {
      priv->set_buf_live++;
    }

  /* Point the hardware's frame writer at this buffer.  Done on every
   * call, which is also how the next frame gets re-armed from the
   * frame-done path (reference: dvp_camera_yuv_eof_handler()'s
   * bk_yuv_buf_set_em_base_addr()).
   *
   * In JPEG mode the module writes no frames at all -- the encoder's output
   * is drained by DMA -- so the equivalent re-arm is pointing that channel
   * at the new buffer and restarting it.
   */

  if (priv->jpeg && priv->jpeg_software)
    {
      /* Software JPEG: the module's frame writer stays on the staging frame,
       * and the application's buffer only ever receives the encoded file
       * from the work queue.  Arming the hardware drain channel here -- what
       * the branch below does -- pointed a DMA from the (idle) encoder FIFO
       * straight at the application's buffer, which is how the first
       * attempt came back as a valid JPEG header followed by 0xff filler.
       */

      if (priv->jpeg_raw[priv->jpeg_raw_fill] != NULL)
        {
          bk7258_yuv_buf_set_frame_buffer(
            (uint32_t)(uintptr_t)priv->jpeg_raw[priv->jpeg_raw_fill]);
        }

      /* The software encoder writes the JPEG from byte 0 and has the whole
       * buffer, so give it the real capacity rather than the drain window
       * computed above: that window reserves BK7258_JPEG_ENC_PAD for the
       * header the hardware path has to graft on, and rounds down to the
       * drain channel's transfer_len -- neither applies here.
       */

      priv->frame_buf_size = size;
      priv->jpeg_buf_armed = true;
    }
  else if (priv->jpeg)
    {
      /* Nothing to do: the drain writes into the ring, not into the
       * application's buffer, so a new buffer does not touch the DMA.  This
       * used to re-arm the channel here, which is exactly what broke the
       * bitstream.
       */
    }
  else
    {
      bk7258_yuv_buf_set_frame_buffer(phys);
    }

  if (!up_interrupt_context())
    {
      printf("bk7258_camera_imgdata: set_buf: addr=%p frame_bytes=%u "
             "(buffer size given=%u)\n",
             addr, (unsigned int)priv->frame_buf_size, (unsigned int)size);
    }

  return OK;
}

static int bk7258_camera_imgdata_validate_frame_setting(
    FAR struct imgdata_s *data, uint8_t nr_datafmts,
    FAR imgdata_format_t *datafmts, FAR imgdata_interval_t *interval)
{
  FAR struct bk7258_camera_imgdata_s *priv =
      (FAR struct bk7258_camera_imgdata_s *)data;
  uint16_t w;
  uint16_t h;

  if (nr_datafmts < 1)
    {
      return -EINVAL;
    }

  if (datafmts[IMGDATA_FMT_MAIN].pixelformat != IMGDATA_PIX_FMT_UYVY &&
      datafmts[IMGDATA_FMT_MAIN].pixelformat != IMGDATA_PIX_FMT_JPEG)
    {
      return -EINVAL;
    }

  w = datafmts[IMGDATA_FMT_MAIN].width;
  h = datafmts[IMGDATA_FMT_MAIN].height;

  /* YUV_BUF's pixel register counts 8x8 blocks, so a geometry that is not a
   * multiple of 8 cannot be expressed at all -- it would silently capture a
   * truncated frame.
   */

