open-vela/contest2026_264_VelaSightsuixingAIzhinengyanjing/board/beken/chips/bk7258/bk7258_camera_imgdata.c
  if (w == 0 || h == 0 ||
      (w % BK7258_CAMERA_ALIGN) != 0 || (h % BK7258_CAMERA_ALIGN) != 0)
    {
      return -EINVAL;
    }

  if ((uint32_t)w * h * 2u >
      BK7258_CAMERA_PSRAM_END - BK7258_CAMERA_PSRAM_BASE)
    {
      return -EINVAL;
    }

  /* Latched here rather than in start_capture() because set_buf() needs it
   * first: the framework calls this on VIDIOC_S_FMT, then allocates and
   * queues buffers, and only then starts streaming.  A "validate" that also
   * records is not pretty, but the alternative -- deriving the geometry from
   * the buffer size in set_buf() -- cannot tell 640x480 from 800x384.
   */

  priv->width = w;
  priv->height = h;
  priv->jpeg = datafmts[IMGDATA_FMT_MAIN].pixelformat ==
               IMGDATA_PIX_FMT_JPEG;

#ifdef CONFIG_BK7258_CAMERA_HW_JPEG
  priv->jpeg_software = priv->jpeg && g_sw_jpeg != NULL && w > 640u;
#else
  priv->jpeg_software = priv->jpeg && g_sw_jpeg != NULL;
#endif

  /* The buffer size the framework will hand to set_buf().
   *
   * For UYVY it is fixed by the geometry: the module writes width*height*2
   * bytes and nothing else will do, so record it here and reject a smaller
   * buffer later.
   *
   * For JPEG there is nothing to record.  v4l2_cap.c's get_bufsize() honours
   * the format's sizeimage first and only computes width*height when the
   * application left it at zero, so the capacity is the application's to
   * choose and is not knowable from the geometry -- an earlier version
   * assumed width*height here and rejected every buffer from an application
   * that set a smaller sizeimage (packages/ai_agent asks for 160KB, which is
   * below 480*480).  set_buf() takes the real capacity from its own
   * argument.
   */

  priv->frame_bytes = priv->jpeg ? 0u : (uint32_t)w * h * 2u;

  return OK;
}

static int bk7258_camera_imgdata_start_capture(
    FAR struct imgdata_s *data, uint8_t nr_datafmts,
    FAR imgdata_format_t *datafmts, FAR imgdata_interval_t *interval,
    imgdata_capture_t callback, FAR void *arg)
{
  FAR struct bk7258_camera_imgdata_s *priv =
      (FAR struct bk7258_camera_imgdata_s *)data;
  struct bk7258_jpeg_enc_stats_s st;
  int ret;

  printf("bk7258_camera_imgdata: start_capture: entry, frame_buf=%p "
         "frame_buf_size=%u\n", priv->frame_buf,
         (unsigned int)priv->frame_buf_size);

  ret = bk7258_camera_imgdata_validate_frame_setting(data, nr_datafmts,
                                                      datafmts, interval);
  if (ret < 0)
    {
      printf("bk7258_camera_imgdata: start_capture: validate failed, "
             "ret=%d\n", ret);
      return ret;
    }

  if (priv->frame_buf == NULL)
    {
      printf("bk7258_camera_imgdata: start_capture: frame_buf is NULL, "
             "-EINVAL\n");
      return -EINVAL;
    }

  priv->capture_cb = callback;
  priv->capture_cb_arg = arg;
  priv->frames_done = 0;
  priv->timeouts = 0;
  priv->jpeg_chunks = 0;
  priv->jpeg_short = 0;

  /* Ahead of the software/hardware split below, because both pace themselves
   * from this and only one of them is taken.
   */

  bk7258_camera_jpeg_sample_period(priv, interval);

  bk7258_yuv_buf_configure(priv->width, priv->height);

  if (priv->jpeg && priv->jpeg_software)
    {
      /* Software JPEG: capture UYVY exactly as the raw path does, into a
       * staging frame of our own -- the application's buffer is sized for a
       * JPEG file, roughly a tenth of a raw frame -- and let the work queue
       * encode it.  The hardware JPEG block stays out of the way entirely.
       */

      priv->jpeg_raw_bytes = (uint32_t)priv->width * priv->height * 2u;

      if (priv->jpeg_raw[0] == NULL)
        {
          priv->jpeg_raw[0] = bk7258_media_pool_alloc(
              BK7258_PSRAM_POOL_DISPLAY, 32, priv->jpeg_raw_bytes);
        }

      if (priv->jpeg_raw[0] == NULL)
        {
          printf("bk7258_camera_imgdata: start_capture: no PSRAM for the "
                 "%u-byte software-JPEG staging frame\n",
                 (unsigned int)priv->jpeg_raw_bytes);
          return -ENOMEM;
        }

      priv->jpeg_raw_fill = 0;
      priv->jpeg_raw_ready = -1;
      priv->jpeg_next_sample = clock_systime_ticks();

      priv->jpeg_encoding = false;
      priv->jpeg_sw_frames = 0;
      priv->jpeg_sw_drops = 0;
      priv->jpeg_sw_skipped = 0;
      priv->jpeg_sw_busy = 0;
      priv->jpeg_sw_nobuf = 0;
      priv->set_buf_live = 0;
      priv->jpeg_buf_armed = priv->frame_buf != NULL &&
                             priv->frame_buf_size != 0;

      bk7258_yuv_buf_set_frame_buffer((uint32_t)(uintptr_t)priv->jpeg_raw[0]);

      priv->capturing = true;
      priv->start_ticks = clock_systime_ticks();
      bk7258_yuv_buf_start();
    }
  else if (priv->jpeg)
    {
      /* Order matters: the drain channel must be running before the encoder
       * is, or the first bytes of the first frame are produced with nothing
       * listening on the FIFO.
       */

      /* The encoder's input staging area, which is what YUV_BUF's
       * frame-buffer register means in JPEG mode.  It must not be the V4L2
       * buffer: see BK7258_CAMERA_JPEG_STAGE_LINES.
       */

      priv->jpeg_stage_bytes = (uint32_t)priv->width *
                               BK7258_CAMERA_JPEG_STAGE_LINES * 2u;

      if (priv->jpeg_stage == NULL)
        {
          priv->jpeg_stage = bk7258_media_pool_alloc(
              BK7258_PSRAM_POOL_DISPLAY, 32, priv->jpeg_stage_bytes);
        }

      if (priv->jpeg_stage == NULL)
        {
          printf("bk7258_camera_imgdata: start_capture: no PSRAM for the "
                 "%u-byte encoder staging area\n",
                 (unsigned int)priv->jpeg_stage_bytes);
          return -ENOMEM;
        }

      /* The drain ring.  Sized to several frames so a frame is never
       * overwritten before the EOF handler has copied it out; the copy
       * happens immediately, so this is slack, not a requirement.
       */

      priv->jpeg_ring_bytes = BK7258_CAMERA_JPEG_RING_CHUNKS *
                              BK7258_CAMERA_JPEG_CHUNK;

