open-vela/contest2026_264_VelaSightsuixingAIzhinengyanjing/board/beken/chips/bk7258/bk7258_camera_imgdata.c
      if (priv->jpeg_ring == NULL)
        {
          priv->jpeg_ring = bk7258_media_pool_alloc(
              BK7258_PSRAM_POOL_DISPLAY, 32, priv->jpeg_ring_bytes);
        }

      if (priv->jpeg_ring == NULL)
        {
          printf("bk7258_camera_imgdata: start_capture: no PSRAM for the "
                 "%u-byte JPEG drain ring\n",
                 (unsigned int)priv->jpeg_ring_bytes);
          return -ENOMEM;
        }

      if (priv->jpeg_validate_scratch == NULL)
        {
          priv->jpeg_validate_scratch =
            kmm_malloc(BK7258_CAMERA_JPEG_VALIDATE_BYTES);
          priv->jpeg_validate_scratch_bytes =
            priv->jpeg_validate_scratch == NULL ? 0 :
            BK7258_CAMERA_JPEG_VALIDATE_BYTES;
        }

      if (priv->jpeg_validate_scratch == NULL)
        {
          printf("bk7258_camera_imgdata: start_capture: no memory for "
                 "the %u-byte JPEG validator scratch\n",
                 BK7258_CAMERA_JPEG_VALIDATE_BYTES);
          return -ENOMEM;
        }

      /* Which region each buffer landed in, because that is what the cost per
       * frame turns on and neither is chosen by this driver.
       */

      printf("bk7258_camera_imgdata: start_capture: prefix %u B at %p (%s), "
             "scratch %u B at %p (%s)\n",
             (unsigned int)sizeof(g_jpeg_prefix), g_jpeg_prefix,
             BK7258_CAMERA_IS_PSRAM(g_jpeg_prefix) ? "PSRAM" : "SRAM",
             (unsigned int)priv->jpeg_validate_scratch_bytes,
             priv->jpeg_validate_scratch,
             BK7258_CAMERA_IS_PSRAM(priv->jpeg_validate_scratch) ?
               "PSRAM" : "SRAM");

      priv->jpeg_validate_ticks = 0;
      priv->jpeg_validate_runs = 0;
      priv->jpeg_ring_over = 0;
      priv->jpeg_ring_slot = 0;
      priv->jpeg_resync = 0;
      priv->jpeg_no_soi = 0;
      priv->jpeg_finish_pending = 0;
      priv->jpeg_pending_mask = 0;
      priv->jpeg_pending_delta = 0;
      priv->jpeg_bit_fixed = 0;
      priv->jpeg_bit_fail = 0;
      priv->jpeg_hw_busy = 0;
      priv->jpeg_sw_skipped = 0;
      priv->jpeg_error = false;
      priv->jpeg_copy_cycles = 0;
      priv->jpeg_hdr_cycles = 0;
      priv->jpeg_scratch_cycles = 0;
      priv->jpeg_realign_cycles = 0;
      priv->jpeg_prefix_cycles = 0;
      priv->jpeg_prefix_miss = 0;
      priv->jpeg_drain_spins_max = 0;
      priv->jpeg_drain_spins_sum = 0;
      priv->jpeg_drain_timeouts = 0;
      priv->jpeg_recon_delta = 0;
      priv->jpeg_recon_worst = 0;
      priv->jpeg_recon_bad = 0;

      /* Seeded to "due now" so the first frame of a session is never delayed
       * by the pacing; the period itself was computed before the split above.
       */

      priv->jpeg_next_sample = clock_systime_ticks();

      bk7258_yuv_buf_set_frame_buffer((uint32_t)(uintptr_t)priv->jpeg_stage);

      bk7258_jpeg_enc_configure(priv->width, priv->height);
      bk7258_jpeg_enc_set_buffer((uint32_t)(uintptr_t)priv->frame_buf);
      bk7258_jpeg_enc_register_callback(bk7258_camera_jpeg_eof, priv);

      bk7258_dma_set_channel_callback(BK7258_CAMERA_JPEG_DMA_CH,
                                      bk7258_camera_jpeg_chunk_done, priv);
      bk7258_jpeg_enc_get_stats(&st);
      priv->jpeg_err_seen = st.err_count;
      priv->jpeg_resets = 0;
      priv->jpeg_vsyncs = 0;
      bk7258_yuv_buf_set_vsync_callback(bk7258_camera_jpeg_vsync, priv);
      priv->capturing = true;
      bk7258_camera_jpeg_dma_arm(priv);

      priv->start_ticks = clock_systime_ticks();
      priv->jpeg_start_cycles = up_perf_gettime();
      bk7258_yuv_buf_start_jpeg();
      bk7258_jpeg_enc_start();
    }
  else
    {
      bk7258_yuv_buf_set_frame_buffer((uint32_t)(uintptr_t)priv->frame_buf);

      priv->capturing = true;
      priv->start_ticks = clock_systime_ticks();
      bk7258_yuv_buf_start();
    }

  bk7258_camera_watchdog_arm(priv);

  bk7258_yuv_buf_dump_status("start_capture: started");

  if (priv->jpeg)
    {
      bk7258_jpeg_enc_dump_status("start_capture: started");
    }

  printf("bk7258_camera_imgdata: start_capture: complete at %ux%u "
         "(%s, %u buffer bytes), watchdog=%dms\n",
         (unsigned int)priv->width, (unsigned int)priv->height,
         priv->jpeg ? "JPEG" : "UYVY",
         (unsigned int)priv->frame_bytes, BK7258_CAMERA_WATCHDOG_MS);

  return OK;
}

static int bk7258_camera_imgdata_stop_capture(FAR struct imgdata_s *data)
{
  FAR struct bk7258_camera_imgdata_s *priv =
      (FAR struct bk7258_camera_imgdata_s *)data;

  priv->capturing = false;
  wd_cancel(&priv->watchdog);

  if (priv->jpeg)
    {
      /* Encoder first, then the channel that drains it: stopping the drain
       * while the encoder still produced output would leave the FIFO
       * filling with nobody reading it.
       */

      bk7258_yuv_buf_set_vsync_callback(NULL, NULL);
      bk7258_jpeg_enc_stop();
      bk7258_dma_stop_channel(BK7258_CAMERA_JPEG_DMA_CH);
    }

  bk7258_yuv_buf_stop();

  if (priv->jpeg_stage != NULL && !up_interrupt_context())
    {
      bk7258_media_pool_free(BK7258_PSRAM_POOL_DISPLAY, priv->jpeg_stage);
      priv->jpeg_stage = NULL;
    }

  if (priv->jpeg_ring != NULL && !up_interrupt_context())
    {
      bk7258_media_pool_free(BK7258_PSRAM_POOL_DISPLAY, priv->jpeg_ring);
      priv->jpeg_ring = NULL;
    }

  if (priv->jpeg_validate_scratch != NULL && !up_interrupt_context())
    {
      kmm_free(priv->jpeg_validate_scratch);
      priv->jpeg_validate_scratch = NULL;
      priv->jpeg_validate_scratch_bytes = 0;
    }

  if (!up_interrupt_context())
    {
      int slot;

      for (slot = 0; slot < 2; slot++)
        {
          if (priv->jpeg_raw[slot] != NULL)
            {
              bk7258_media_pool_free(BK7258_PSRAM_POOL_DISPLAY,
                                     priv->jpeg_raw[slot]);
              priv->jpeg_raw[slot] = NULL;
            }
        }
    }

  /* Interrupt context is possible here: complete_capture() calls
   * IMGDATA_STOP_CAPTURE() when no vacant container is left.
   */

  if (!up_interrupt_context())
    {
      uint32_t ms = TICK2MSEC(clock_systime_ticks() - priv->start_ticks);

      /* Measured frame rate, not the requested one: the only way to see
       * whether the sensor's programmed rate is what the hardware
       * actually delivers.
       */

      printf("bk7258_camera_imgdata: stop_capture: ring_over=%u resync=%u "
             "no_soi=%u sampler_skipped=%u hw_busy=%u (target %u fps)\n",
             (unsigned int)priv->jpeg_ring_over,
             (unsigned int)priv->jpeg_resync,
             (unsigned int)priv->jpeg_no_soi,
             (unsigned int)priv->jpeg_sw_skipped,
             (unsigned int)priv->jpeg_hw_busy,
             (unsigned int)priv->jpeg_fps);

      printf("bk7258_camera_imgdata: stop_capture: frames=%u timeouts=%u "
             "elapsed=%ums measured=%u.%02u fps\n",
             (unsigned int)priv->frames_done,
             (unsigned int)priv->timeouts, (unsigned int)ms,
             (unsigned int)(ms ? priv->frames_done * 1000u / ms : 0u),
             (unsigned int)(ms ? priv->frames_done * 100000u / ms % 100u
                               : 0u));

      if (priv->jpeg)
        {
          /* The drain path's own numbers.  chunks == 0 together with a
           * non-zero SOF count is the signature of a channel that is
           * configured but moving nothing: the encoder starts frames, its
           * FIFO fills, YUV_BUF reports sen_full, and no EOF ever arrives.
           */

          if (priv->jpeg_software)
            {
              printf("bk7258_camera_imgdata: stop_capture: sw_jpeg "
                     "frames=%u dropped_oldest=%u sampler_skipped=%u "
                     "busy=%u nobuf=%u due_in=%ld "
                     "set_buf_live=%u armed=%d encoding=%d "
                     "(target %u fps)\n",
                     (unsigned int)priv->jpeg_sw_frames,
                     (unsigned int)priv->jpeg_sw_drops,
                     (unsigned int)priv->jpeg_sw_skipped,
                     (unsigned int)priv->jpeg_sw_busy,
                     (unsigned int)priv->jpeg_sw_nobuf,
                     (long)((sclock_t)(priv->jpeg_next_sample -
                                       priv->jpeg_last_now)),
                     (unsigned int)priv->set_buf_live,
                     (int)priv->jpeg_buf_armed,
                     (int)priv->jpeg_encoding,
                     (unsigned int)priv->jpeg_fps);
            }

          printf("bk7258_camera_imgdata: stop_capture: jpeg chunks=%u "
                 "short=%u resets=%u vsyncs=%u hdr_fail=%u "
                 "bit_fixed=%u bit_fail=%u eoi_delta=%d "
                 "dma_remain=%u finish_pending=%u pending_mask=0x%08x "
                 "pending_delta=%d\n",
                 (unsigned int)priv->jpeg_chunks,
                 (unsigned int)priv->jpeg_short,
                 (unsigned int)priv->jpeg_resets,
                 (unsigned int)priv->jpeg_vsyncs,
                 (unsigned int)priv->jpeg_hdr_fail,
                 (unsigned int)priv->jpeg_bit_fixed,
                 (unsigned int)priv->jpeg_bit_fail,
                 (int)priv->jpeg_eoi_delta,
                 (unsigned int)bk7258_dma_get_channel_remain_len(
                     BK7258_CAMERA_JPEG_DMA_CH),
                 (unsigned int)priv->jpeg_finish_pending,
                 (unsigned int)priv->jpeg_pending_mask,
                 (int)priv->jpeg_pending_delta);
          printf("bk7258_camera_imgdata: stop_capture: validator runs=%u "
                 "total_ticks=%u avg=%u ms\n",
                 (unsigned int)priv->jpeg_validate_runs,
                 (unsigned int)priv->jpeg_validate_ticks,
                 (unsigned int)(priv->jpeg_validate_runs ?
                   TICK2MSEC(priv->jpeg_validate_ticks) /
                   priv->jpeg_validate_runs : 0u));

