open-vela/contest2026_264_VelaSightsuixingAIzhinengyanjing/board/beken/chips/bk7258/bk7258_camera_imgdata.c
          /* Cycle-resolution breakdown, and the core clock it implies.
           *
           * Reported per delivered frame so the four numbers add up to
           * something comparable with the validator average above, and as a
           * derived frequency so that CONFIG_BK7258_CPU_FREQ_HZ -- which
           * only ever reached systick -- can be checked against the
           * hardware rather than believed.
           *
           * Only for the hardware path: everything below is maintained by
           * the drain and validation code, so on a software session it would
           * print whatever the last hardware session left behind.
           */

          if (!priv->jpeg_software && priv->jpeg_validate_runs != 0)
            {
              uint32_t runs = priv->jpeg_validate_runs;

              printf("bk7258_camera_imgdata: stop_capture: cycles/frame "
                     "copy=%" PRIu64 " hdr=%" PRIu64 " prefix=%" PRIu64
                     " scratch=%" PRIu64 " realign=%" PRIu64
                     " (validate_mcus=%d prefix_miss=%u)\n",
                     priv->jpeg_copy_cycles / runs,
                     priv->jpeg_hdr_cycles / runs,
                     priv->jpeg_prefix_cycles / runs,
                     priv->jpeg_scratch_cycles / runs,
                     priv->jpeg_realign_cycles / runs,
                     CONFIG_BK7258_CAMERA_JPEG_VALIDATE_MCUS,
                     (unsigned int)priv->jpeg_prefix_miss);
            }

          if (!priv->jpeg_software && ms != 0)
            {
              /* 64-bit throughout.  This was a uint32_t, which at the
               * ~480 MHz being measured wraps every 8.95 s, so any session
               * longer than that reported a fraction of the real clock: a
               * 48 s session on 2026-09-03 printed 38519 kHz, five wraps
               * short of the 481 MHz it had actually measured.  The value is
               * here to check CONFIG_BK7258_CPU_FREQ_HZ against the hardware,
               * which it cannot do if it silently divides by five.
               */

              uint64_t elapsed_cycles =
                up_perf_gettime() - priv->jpeg_start_cycles;

              printf("bk7258_camera_imgdata: stop_capture: core clock "
                     "measured=%" PRIu64 " kHz configured=%u kHz\n",
                     elapsed_cycles / (uint64_t)ms,
                     (unsigned int)(CONFIG_BK7258_CPU_FREQ_HZ / 1000));
            }

          if (!priv->jpeg_software)
            {
              printf("bk7258_camera_imgdata: stop_capture: drain spins "
                     "max=%u avg=%u timeouts=%u limit=%u\n",
                     (unsigned int)priv->jpeg_drain_spins_max,
                     (unsigned int)(priv->jpeg_vsyncs ?
                       priv->jpeg_drain_spins_sum / priv->jpeg_vsyncs : 0u),
                     (unsigned int)priv->jpeg_drain_timeouts,
                     (unsigned int)BK7258_CAMERA_JPEG_DRAIN_SPINS);

              printf("bk7258_camera_imgdata: stop_capture: reconcile "
                     "last=%d worst=%d outside_window=%u slack=%d "
                     "enforced=%d\n",
                     (int)priv->jpeg_recon_delta,
                     (int)priv->jpeg_recon_worst,
                     (unsigned int)priv->jpeg_recon_bad,
                     BK7258_CAMERA_JPEG_RECON_SLACK,
                     BK7258_CAMERA_JPEG_RECON_ENFORCED);
            }

          printf("bk7258_camera_imgdata: stop_capture: bytes[%u-4..+4] = "
                 "%02x %02x %02x %02x | %02x %02x %02x %02x\n",
                 (unsigned int)priv->jpeg_tail_at,
                 priv->jpeg_tail[0], priv->jpeg_tail[1],
                 priv->jpeg_tail[2], priv->jpeg_tail[3],
                 priv->jpeg_tail[4], priv->jpeg_tail[5],
                 priv->jpeg_tail[6], priv->jpeg_tail[7]);
          bk7258_jpeg_enc_dump_status("stop_capture");
        }
    }

  return OK;
}

/* V4L2_REQBUFS_COUNT_MAX (3) capture buffers at one 640x480 YUYV frame
 * (614400 bytes) exceed this board's internal SRAM heap
 * (CONFIG_RAM_SIZE=344064 bytes), so the framework's default
 * kumm_memalign()-backed allocation cannot hold the buffer pool.  This
 * board has a separate 16MB PSRAM region not mapped into the kernel's
 * malloc arena; imgdata_ops_s.alloc/free (the framework's documented
 * mechanism for drivers whose buffers must come from a non-default
 * memory pool) routes allocation to bk7258_psram.c's
 * bk7258_media_pool_alloc()/_free() instead.  YUV_BUF also requires the
 * frame buffer to be in PSRAM (see set_buf()).
 */

static void *bk7258_camera_imgdata_alloc(FAR struct imgdata_s *data,
                                          uint32_t align_size,
                                          uint32_t size)
{
  return bk7258_media_pool_alloc(BK7258_PSRAM_POOL_DISPLAY,
                                  align_size, size);
}

static void bk7258_camera_imgdata_free(FAR struct imgdata_s *data,
                                        void *addr)
{
  bk7258_media_pool_free(BK7258_PSRAM_POOL_DISPLAY, addr);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

FAR struct imgdata_s *bk7258_camera_imgdata_initialize(void)
{
  return &g_bk7258_camera_imgdata.data;
}
